<!-- terragrunt-plan -->
### :seedling: Terragrunt Plan (env: **dev**)
**Status**: success
**Log**: [📦 terragrunt-plan log](https://github.com/kuma0128/terraform-openmetadata-aws-assets/actions/runs/16328805409/artifacts/3548710749)

<details><summary>Show plan output</summary>

```terraform
19:43:58.360 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./cicd

Group 2
- Module ./backend

Group 3
- Module ./dns

Group 4
- Module ./aws


19:43:58.547 INFO   [cicd] Downloading Terraform configurations from ../../../.. into ./cicd/.terragrunt-cache/h82z1OolwFBY1ROsIWPS9NYghzo/vxdbUoFBPPcfo8ey7QUdnvPtOeY
19:43:59.296 INFO   [cicd] terraform: Initializing the backend...
19:44:00.610 INFO   [cicd] terraform: 
19:44:00.610 INFO   [cicd] terraform: Successfully configured the backend "s3"! Terraform will automatically
19:44:00.610 INFO   [cicd] terraform: use this backend unless the backend configuration changes.
19:44:00.917 INFO   [cicd] terraform: Initializing modules...
19:44:00.918 INFO   [cicd] terraform: - iam_github_oidc in ../../../modules/cicd/iam_github_oidc
19:44:00.919 INFO   [cicd] terraform: Initializing provider plugins...
19:44:00.919 INFO   [cicd] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
19:44:01.028 INFO   [cicd] terraform: - Finding latest version of hashicorp/tls...
19:44:01.084 INFO   [cicd] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
19:44:01.154 INFO   [cicd] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
19:44:01.341 INFO   [cicd] terraform: - Installing hashicorp/aws v6.0.0...
19:44:05.765 INFO   [cicd] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
19:44:05.948 INFO   [cicd] terraform: - Installing hashicorp/http v3.5.0...
19:44:06.252 INFO   [cicd] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
19:44:06.417 INFO   [cicd] terraform: - Installing hashicorp/tls v4.1.0...
19:44:06.735 INFO   [cicd] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
19:44:06.864 INFO   [cicd] terraform: - Installing hashicorp/random v3.7.2...
19:44:07.160 INFO   [cicd] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
19:44:07.160 INFO   [cicd] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
19:44:07.160 INFO   [cicd] terraform: selections it made above. Include this file in your version control repository
19:44:07.161 INFO   [cicd] terraform: so that Terraform can guarantee to make the same selections by default when
19:44:07.161 INFO   [cicd] terraform: you run "terraform init" in the future.
19:44:07.161 INFO   [cicd] terraform: Terraform has been successfully initialized!
19:44:07.164 INFO   [cicd] Executing hook: fmt
19:44:07.186 INFO   [cicd] Executing hook: validate
Success! The configuration is valid.

19:44:13.087 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Reading...
19:44:13.189 STDOUT [cicd] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
19:44:13.194 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Reading...
19:44:13.297 STDOUT [cicd] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
19:44:13.878 STDOUT [cicd] terraform: Terraform used the selected providers to generate the following execution
19:44:13.878 STDOUT [cicd] terraform: plan. Resource actions are indicated with the following symbols:
19:44:13.878 STDOUT [cicd] terraform:   + create
19:44:13.878 STDOUT [cicd] terraform: Terraform will perform the following actions:
19:44:13.878 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_openid_connect_provider.this will be created
19:44:13.878 STDOUT [cicd] terraform:   + resource "aws_iam_openid_connect_provider" "this" {
19:44:13.878 STDOUT [cicd] terraform:       + arn             = (known after apply)
19:44:13.878 STDOUT [cicd] terraform:       + client_id_list  = [
19:44:13.879 STDOUT [cicd] terraform:           + "sts.amazonaws.com",
19:44:13.879 STDOUT [cicd] terraform:         ]
19:44:13.879 STDOUT [cicd] terraform:       + id              = (known after apply)
19:44:13.879 STDOUT [cicd] terraform:       + tags_all        = (known after apply)
19:44:13.879 STDOUT [cicd] terraform:       + thumbprint_list = [
19:44:13.879 STDOUT [cicd] terraform:           + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",
19:44:13.879 STDOUT [cicd] terraform:           + "dd55b4520291e276588f0dd02fafd83a7368e0fa",
19:44:13.879 STDOUT [cicd] terraform:           + "7560d6f40fa55195f740ee2b1b7c0b4836cbe103",
19:44:13.879 STDOUT [cicd] terraform:         ]
19:44:13.879 STDOUT [cicd] terraform:       + url             = "https://token.actions.githubusercontent.com"
19:44:13.879 STDOUT [cicd] terraform:     }
19:44:13.879 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role.this will be created
19:44:13.879 STDOUT [cicd] terraform:   + resource "aws_iam_role" "this" {
19:44:13.879 STDOUT [cicd] terraform:       + arn                   = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + assume_role_policy    = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + create_date           = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + force_detach_policies = false
19:44:13.880 STDOUT [cicd] terraform:       + id                    = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + managed_policy_arns   = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + max_session_duration  = 3600
19:44:13.880 STDOUT [cicd] terraform:       + name                  = "ethan-dev-iamrole-apne1-oidc"
19:44:13.880 STDOUT [cicd] terraform:       + name_prefix           = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + path                  = "/"
19:44:13.880 STDOUT [cicd] terraform:       + tags_all              = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + unique_id             = (known after apply)
19:44:13.880 STDOUT [cicd] terraform:       + inline_policy (known after apply)
19:44:13.880 STDOUT [cicd] terraform:     }
19:44:13.880 STDOUT [cicd] terraform:   # module.iam_github_oidc.aws_iam_role_policy_attachment.this will be created
19:44:13.880 STDOUT [cicd] terraform:   + resource "aws_iam_role_policy_attachment" "this" {
19:44:13.880 STDOUT [cicd] terraform:       + id         = (known after apply)
19:44:13.881 STDOUT [cicd] terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
19:44:13.881 STDOUT [cicd] terraform:       + role       = "ethan-dev-iamrole-apne1-oidc"
19:44:13.881 STDOUT [cicd] terraform:     }
19:44:13.881 STDOUT [cicd] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
19:44:13.881 STDOUT [cicd] terraform: 
19:44:13.890 INFO   [backend] Downloading Terraform configurations from ../../../.. into ./backend/.terragrunt-cache/VzF6bAw0aoltoYNo-Owt1TlKJYU/vxdbUoFBPPcfo8ey7QUdnvPtOeY
19:44:14.506 INFO   [backend] terraform: Initializing the backend...
19:44:15.789 INFO   [backend] terraform: 
19:44:15.789 INFO   [backend] terraform: Successfully configured the backend "s3"! Terraform will automatically
19:44:15.789 INFO   [backend] terraform: use this backend unless the backend configuration changes.
19:44:16.100 INFO   [backend] terraform: Initializing modules...
19:44:16.101 INFO   [backend] terraform: - backend in ../../../modules/backend
19:44:16.102 INFO   [backend] terraform: Initializing provider plugins...
19:44:16.102 INFO   [backend] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
19:44:16.215 INFO   [backend] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
19:44:16.271 INFO   [backend] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
19:44:16.461 INFO   [backend] terraform: - Installing hashicorp/aws v6.0.0...
19:44:22.222 INFO   [backend] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
19:44:22.348 INFO   [backend] terraform: - Installing hashicorp/http v3.5.0...
19:44:22.666 INFO   [backend] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
19:44:22.793 INFO   [backend] terraform: - Installing hashicorp/random v3.7.2...
19:44:23.115 INFO   [backend] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
19:44:23.116 INFO   [backend] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
19:44:23.116 INFO   [backend] terraform: selections it made above. Include this file in your version control repository
19:44:23.116 INFO   [backend] terraform: so that Terraform can guarantee to make the same selections by default when
19:44:23.116 INFO   [backend] terraform: you run "terraform init" in the future.
19:44:23.116 INFO   [backend] terraform: Terraform has been successfully initialized!
19:44:23.119 INFO   [backend] Executing hook: fmt
19:44:23.143 INFO   [backend] Executing hook: validate
Success! The configuration is valid.

19:44:29.569 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Reading...
19:44:30.362 STDOUT [backend] terraform: module.backend.data.aws_s3_bucket.this: Read complete after 0s [id=ethan-s3-apne1-tfstate]
19:44:30.490 STDOUT [backend] terraform: Terraform used the selected providers to generate the following execution
19:44:30.490 STDOUT [backend] terraform: plan. Resource actions are indicated with the following symbols:
19:44:30.490 STDOUT [backend] terraform:   + create
19:44:30.490 STDOUT [backend] terraform: Terraform will perform the following actions:
19:44:30.490 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_policy.this will be created
19:44:30.490 STDOUT [backend] terraform:   + resource "aws_s3_bucket_policy" "this" {
19:44:30.490 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"
19:44:30.491 STDOUT [backend] terraform:       + id     = (known after apply)
19:44:30.491 STDOUT [backend] terraform:       + policy = jsonencode(
19:44:30.491 STDOUT [backend] terraform:             {
19:44:30.491 STDOUT [backend] terraform:               + Statement = [
19:44:30.491 STDOUT [backend] terraform:                   + {
19:44:30.491 STDOUT [backend] terraform:                       + Action    = "s3:*"
19:44:30.491 STDOUT [backend] terraform:                       + Condition = {
19:44:30.491 STDOUT [backend] terraform:                           + NotIpAddress    = {
19:44:30.491 STDOUT [backend] terraform:                               + "aws:SourceIp" = [
19:44:30.491 STDOUT [backend] terraform:                                   + "192.0.2.0/24",
19:44:30.492 STDOUT [backend] terraform:                                 ]
19:44:30.492 STDOUT [backend] terraform:                             }
19:44:30.492 STDOUT [backend] terraform:                           + StringNotEquals = {
19:44:30.492 STDOUT [backend] terraform:                               + "aws:SourceVpce" = []
19:44:30.492 STDOUT [backend] terraform:                             }
19:44:30.492 STDOUT [backend] terraform:                           + StringNotLike   = {
19:44:30.492 STDOUT [backend] terraform:                               + "aws:userid" = []
19:44:30.492 STDOUT [backend] terraform:                             }
19:44:30.492 STDOUT [backend] terraform:                         }
19:44:30.492 STDOUT [backend] terraform:                       + Effect    = "Deny"
19:44:30.492 STDOUT [backend] terraform:                       + Principal = "*"
19:44:30.492 STDOUT [backend] terraform:                       + Resource  = [
19:44:30.492 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
19:44:30.492 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
19:44:30.492 STDOUT [backend] terraform:                         ]
19:44:30.492 STDOUT [backend] terraform:                     },
19:44:30.492 STDOUT [backend] terraform:                   + {
19:44:30.492 STDOUT [backend] terraform:                       + Action    = "s3:*"
19:44:30.493 STDOUT [backend] terraform:                       + Condition = {
19:44:30.493 STDOUT [backend] terraform:                           + NumericLessThan = {
19:44:30.493 STDOUT [backend] terraform:                               + "s3:TlsVersion" = "1.2"
19:44:30.493 STDOUT [backend] terraform:                             }
19:44:30.493 STDOUT [backend] terraform:                         }
19:44:30.493 STDOUT [backend] terraform:                       + Effect    = "Deny"
19:44:30.493 STDOUT [backend] terraform:                       + Principal = "*"
19:44:30.493 STDOUT [backend] terraform:                       + Resource  = [
19:44:30.493 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
19:44:30.493 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
19:44:30.493 STDOUT [backend] terraform:                         ]
19:44:30.493 STDOUT [backend] terraform:                       + Sid       = "EnforceTLSv12orHigher"
19:44:30.493 STDOUT [backend] terraform:                     },
19:44:30.493 STDOUT [backend] terraform:                   + {
19:44:30.493 STDOUT [backend] terraform:                       + Action    = "s3:*"
19:44:30.493 STDOUT [backend] terraform:                       + Condition = {
19:44:30.493 STDOUT [backend] terraform:                           + Bool = {
19:44:30.493 STDOUT [backend] terraform:                               + "aws:SecureTransport" = "false"
19:44:30.493 STDOUT [backend] terraform:                             }
19:44:30.493 STDOUT [backend] terraform:                         }
19:44:30.493 STDOUT [backend] terraform:                       + Effect    = "Deny"
19:44:30.494 STDOUT [backend] terraform:                       + Principal = "*"
19:44:30.494 STDOUT [backend] terraform:                       + Resource  = [
19:44:30.494 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate",
19:44:30.494 STDOUT [backend] terraform:                           + "arn:aws:s3:::ethan-s3-apne1-tfstate/*",
19:44:30.494 STDOUT [backend] terraform:                         ]
19:44:30.494 STDOUT [backend] terraform:                       + Sid       = "AllowSSLRequestsOnly"
19:44:30.494 STDOUT [backend] terraform:                     },
19:44:30.494 STDOUT [backend] terraform:                 ]
19:44:30.494 STDOUT [backend] terraform:               + Version   = "2012-10-17"
19:44:30.494 STDOUT [backend] terraform:             }
19:44:30.494 STDOUT [backend] terraform:         )
19:44:30.494 STDOUT [backend] terraform:       + region = "ap-northeast-1"
19:44:30.494 STDOUT [backend] terraform:     }
19:44:30.494 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_public_access_block.this will be created
19:44:30.494 STDOUT [backend] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
19:44:30.494 STDOUT [backend] terraform:       + block_public_acls       = true
19:44:30.494 STDOUT [backend] terraform:       + block_public_policy     = true
19:44:30.494 STDOUT [backend] terraform:       + bucket                  = "ethan-s3-apne1-tfstate"
19:44:30.494 STDOUT [backend] terraform:       + id                      = (known after apply)
19:44:30.494 STDOUT [backend] terraform:       + ignore_public_acls      = true
19:44:30.495 STDOUT [backend] terraform:       + region                  = "ap-northeast-1"
19:44:30.495 STDOUT [backend] terraform:       + restrict_public_buckets = true
19:44:30.495 STDOUT [backend] terraform:     }
19:44:30.495 STDOUT [backend] terraform:   # module.backend.aws_s3_bucket_versioning.this will be created
19:44:30.495 STDOUT [backend] terraform:   + resource "aws_s3_bucket_versioning" "this" {
19:44:30.495 STDOUT [backend] terraform:       + bucket = "ethan-s3-apne1-tfstate"
19:44:30.495 STDOUT [backend] terraform:       + id     = (known after apply)
19:44:30.495 STDOUT [backend] terraform:       + region = "ap-northeast-1"
19:44:30.495 STDOUT [backend] terraform:       + versioning_configuration {
19:44:30.495 STDOUT [backend] terraform:           + mfa_delete = (known after apply)
19:44:30.495 STDOUT [backend] terraform:           + status     = "Enabled"
19:44:30.495 STDOUT [backend] terraform:         }
19:44:30.495 STDOUT [backend] terraform:     }
19:44:30.495 STDOUT [backend] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
19:44:30.495 STDOUT [backend] terraform: 
19:44:30.503 INFO   [dns] Downloading Terraform configurations from ../../../.. into ./dns/.terragrunt-cache/5ZjuMepC-GURAb0rhJZm1Hjryhg/vxdbUoFBPPcfo8ey7QUdnvPtOeY
19:44:31.135 INFO   [dns] terraform: Initializing the backend...
19:44:32.409 INFO   [dns] terraform: 
19:44:32.409 INFO   [dns] terraform: Successfully configured the backend "s3"! Terraform will automatically
19:44:32.409 INFO   [dns] terraform: use this backend unless the backend configuration changes.
19:44:32.733 INFO   [dns] terraform: Initializing modules...
19:44:32.737 INFO   [dns] terraform: - dns in ../../../modules/aws/dns
19:44:32.737 INFO   [dns] terraform: Initializing provider plugins...
19:44:32.737 INFO   [dns] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
19:44:32.858 INFO   [dns] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
19:44:32.914 INFO   [dns] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
19:44:33.104 INFO   [dns] terraform: - Installing hashicorp/http v3.5.0...
19:44:33.420 INFO   [dns] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
19:44:33.553 INFO   [dns] terraform: - Installing hashicorp/random v3.7.2...
19:44:33.888 INFO   [dns] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
19:44:34.019 INFO   [dns] terraform: - Installing hashicorp/aws v6.0.0...
19:44:39.011 INFO   [dns] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
19:44:39.011 INFO   [dns] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
19:44:39.011 INFO   [dns] terraform: selections it made above. Include this file in your version control repository
19:44:39.011 INFO   [dns] terraform: so that Terraform can guarantee to make the same selections by default when
19:44:39.011 INFO   [dns] terraform: you run "terraform init" in the future.
19:44:39.011 INFO   [dns] terraform: Terraform has been successfully initialized!
19:44:39.014 INFO   [dns] Executing hook: fmt
19:44:39.038 INFO   [dns] Executing hook: validate
Success! The configuration is valid.

19:44:45.538 STDOUT [dns] terraform: Terraform used the selected providers to generate the following execution
19:44:45.538 STDOUT [dns] terraform: plan. Resource actions are indicated with the following symbols:
19:44:45.538 STDOUT [dns] terraform:   + create
19:44:45.538 STDOUT [dns] terraform:  %3C= read (data resources)
19:44:45.538 STDOUT [dns] terraform: Terraform will perform the following actions:
19:44:45.538 STDOUT [dns] terraform:   # module.dns.data.aws_iam_policy_document.route53_query will be read during apply
19:44:45.538 STDOUT [dns] terraform:   # (config refers to values not yet known)
19:44:45.538 STDOUT [dns] terraform:  %3C= data "aws_iam_policy_document" "route53_query" {
19:44:45.538 STDOUT [dns] terraform:       + id            = (known after apply)
19:44:45.539 STDOUT [dns] terraform:       + json          = (known after apply)
19:44:45.539 STDOUT [dns] terraform:       + minified_json = (known after apply)
19:44:45.539 STDOUT [dns] terraform:       + statement {
19:44:45.539 STDOUT [dns] terraform:           + actions   = [
19:44:45.539 STDOUT [dns] terraform:               + "logs:CreateLogStream",
19:44:45.539 STDOUT [dns] terraform:               + "logs:PutLogEvents",
19:44:45.539 STDOUT [dns] terraform:             ]
19:44:45.539 STDOUT [dns] terraform:           + resources = [
19:44:45.539 STDOUT [dns] terraform:               + (known after apply),
19:44:45.539 STDOUT [dns] terraform:             ]
19:44:45.539 STDOUT [dns] terraform:           + principals {
19:44:45.539 STDOUT [dns] terraform:               + identifiers = [
19:44:45.539 STDOUT [dns] terraform:                   + "route53.amazonaws.com",
19:44:45.539 STDOUT [dns] terraform:                 ]
19:44:45.539 STDOUT [dns] terraform:               + type        = "Service"
19:44:45.539 STDOUT [dns] terraform:             }
19:44:45.539 STDOUT [dns] terraform:         }
19:44:45.539 STDOUT [dns] terraform:     }
19:44:45.539 STDOUT [dns] terraform:   # module.dns.aws_acm_certificate.cert will be created
19:44:45.539 STDOUT [dns] terraform:   + resource "aws_acm_certificate" "cert" {
19:44:45.540 STDOUT [dns] terraform:       + arn                       = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + domain_name               = "ethan-example.com"
19:44:45.540 STDOUT [dns] terraform:       + domain_validation_options = [
19:44:45.540 STDOUT [dns] terraform:           + {
19:44:45.540 STDOUT [dns] terraform:               + domain_name           = "ethan-example.com"
19:44:45.540 STDOUT [dns] terraform:               + resource_record_name  = (known after apply)
19:44:45.540 STDOUT [dns] terraform:               + resource_record_type  = (known after apply)
19:44:45.540 STDOUT [dns] terraform:               + resource_record_value = (known after apply)
19:44:45.540 STDOUT [dns] terraform:             },
19:44:45.540 STDOUT [dns] terraform:         ]
19:44:45.540 STDOUT [dns] terraform:       + id                        = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + key_algorithm             = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + not_after                 = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + not_before                = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + pending_renewal           = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + region                    = "ap-northeast-1"
19:44:45.540 STDOUT [dns] terraform:       + renewal_eligibility       = (known after apply)
19:44:45.540 STDOUT [dns] terraform:       + renewal_summary           = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + status                    = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + subject_alternative_names = [
19:44:45.541 STDOUT [dns] terraform:           + "ethan-example.com",
19:44:45.541 STDOUT [dns] terraform:         ]
19:44:45.541 STDOUT [dns] terraform:       + tags                      = {
19:44:45.541 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"
19:44:45.541 STDOUT [dns] terraform:         }
19:44:45.541 STDOUT [dns] terraform:       + tags_all                  = {
19:44:45.541 STDOUT [dns] terraform:           + "Name" = "ethan-dev-acm-apne1-cert"
19:44:45.541 STDOUT [dns] terraform:         }
19:44:45.541 STDOUT [dns] terraform:       + type                      = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + validation_emails         = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + validation_method         = "DNS"
19:44:45.541 STDOUT [dns] terraform:       + options (known after apply)
19:44:45.541 STDOUT [dns] terraform:     }
19:44:45.541 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_group.route53_query will be created
19:44:45.541 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_group" "route53_query" {
19:44:45.541 STDOUT [dns] terraform:       + arn               = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + id                = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + log_group_class   = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + name              = "/aws/route53/query"
19:44:45.541 STDOUT [dns] terraform:       + name_prefix       = (known after apply)
19:44:45.541 STDOUT [dns] terraform:       + region            = "ap-northeast-1"
19:44:45.542 STDOUT [dns] terraform:       + retention_in_days = 30
19:44:45.542 STDOUT [dns] terraform:       + skip_destroy      = false
19:44:45.542 STDOUT [dns] terraform:       + tags_all          = (known after apply)
19:44:45.542 STDOUT [dns] terraform:     }
19:44:45.542 STDOUT [dns] terraform:   # module.dns.aws_cloudwatch_log_resource_policy.route53_query will be created
19:44:45.542 STDOUT [dns] terraform:   + resource "aws_cloudwatch_log_resource_policy" "route53_query" {
19:44:45.542 STDOUT [dns] terraform:       + id              = (known after apply)
19:44:45.542 STDOUT [dns] terraform:       + policy_document = (known after apply)
19:44:45.542 STDOUT [dns] terraform:       + policy_name     = "ethan-dev-route53-query"
19:44:45.542 STDOUT [dns] terraform:       + region          = "ap-northeast-1"
19:44:45.542 STDOUT [dns] terraform:     }
19:44:45.542 STDOUT [dns] terraform:   # module.dns.aws_route53_query_log.route53_query will be created
19:44:45.542 STDOUT [dns] terraform:   + resource "aws_route53_query_log" "route53_query" {
19:44:45.542 STDOUT [dns] terraform:       + arn                      = (known after apply)
19:44:45.542 STDOUT [dns] terraform:       + cloudwatch_log_group_arn = (known after apply)
19:44:45.542 STDOUT [dns] terraform:       + id                       = (known after apply)
19:44:45.542 STDOUT [dns] terraform:       + zone_id                  = (known after apply)
19:44:45.542 STDOUT [dns] terraform:     }
19:44:45.542 STDOUT [dns] terraform:   # module.dns.aws_route53_record.cert_validation["ethan-example.com"] will be created
19:44:45.542 STDOUT [dns] terraform:   + resource "aws_route53_record" "cert_validation" {
19:44:45.542 STDOUT [dns] terraform:       + allow_overwrite = true
19:44:45.543 STDOUT [dns] terraform:       + fqdn            = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + id              = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + name            = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + records         = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + ttl             = 60
19:44:45.543 STDOUT [dns] terraform:       + type            = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + zone_id         = (known after apply)
19:44:45.543 STDOUT [dns] terraform:     }
19:44:45.543 STDOUT [dns] terraform:   # module.dns.aws_route53_zone.openmetadata_zone will be created
19:44:45.543 STDOUT [dns] terraform:   + resource "aws_route53_zone" "openmetadata_zone" {
19:44:45.543 STDOUT [dns] terraform:       + arn                 = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + comment             = "Managed by Terraform"
19:44:45.543 STDOUT [dns] terraform:       + force_destroy       = false
19:44:45.543 STDOUT [dns] terraform:       + id                  = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + name                = "ethan-example.com"
19:44:45.543 STDOUT [dns] terraform:       + name_servers        = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + primary_name_server = (known after apply)
19:44:45.543 STDOUT [dns] terraform:       + tags                = {
19:44:45.543 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"
19:44:45.543 STDOUT [dns] terraform:         }
19:44:45.543 STDOUT [dns] terraform:       + tags_all            = {
19:44:45.544 STDOUT [dns] terraform:           + "Name" = "ethan-dev-dns-apne1-openmetadata"
19:44:45.544 STDOUT [dns] terraform:         }
19:44:45.544 STDOUT [dns] terraform:       + zone_id             = (known after apply)
19:44:45.544 STDOUT [dns] terraform:     }
19:44:45.544 STDOUT [dns] terraform: Plan: 6 to add, 0 to change, 0 to destroy.
19:44:45.544 STDOUT [dns] terraform: 
19:44:45.544 STDOUT [dns] terraform: Changes to Outputs:
19:44:45.544 STDOUT [dns] terraform:   + cert_arn             = (known after apply)
19:44:45.544 STDOUT [dns] terraform:   + domain_name          = "ethan-example.com"
19:44:45.544 STDOUT [dns] terraform:   + openmetadata_zone_id = (known after apply)
19:44:47.598 WARN   [aws] Config ./dns/terragrunt.hcl is a dependency of ./aws/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
19:44:47.602 INFO   [aws] Downloading Terraform configurations from ../../../.. into ./aws/.terragrunt-cache/Gkf-XB9erf0W2gWI9HQKwo4xkmE/vxdbUoFBPPcfo8ey7QUdnvPtOeY
19:44:48.292 INFO   [aws] terraform: Initializing the backend...
19:44:49.497 INFO   [aws] terraform: 
19:44:49.497 INFO   [aws] terraform: Successfully configured the backend "s3"! Terraform will automatically
19:44:49.497 INFO   [aws] terraform: use this backend unless the backend configuration changes.
19:44:49.811 INFO   [aws] terraform: Initializing modules...
19:44:49.812 INFO   [aws] terraform: - iam_github_oidc in ../../../modules/cicd/iam_github_oidc
19:44:49.814 INFO   [aws] terraform: - network in ../../../modules/aws/network
19:44:49.815 INFO   [aws] terraform: - openmetadata_aurora in ../../../modules/aws/openmetadata/aurora
19:44:49.815 INFO   [aws] terraform: - openmetadata_cloudwatch in ../../../modules/aws/openmetadata/cloudwatch
19:44:49.816 INFO   [aws] terraform: - openmetadata_ecr in ../../../modules/aws/openmetadata/ecr
19:44:49.819 INFO   [aws] terraform: - openmetadata_ecs in ../../../modules/aws/openmetadata/ecs
19:44:49.820 INFO   [aws] terraform: - openmetadata_iam in ../../../modules/aws/openmetadata/iam
19:44:49.820 INFO   [aws] terraform: - openmetadata_kms_key in ../../../modules/aws/openmetadata/kms_key
19:44:49.821 INFO   [aws] terraform: - openmetadata_lb in ../../../modules/aws/openmetadata/load_balancer
19:44:49.822 INFO   [aws] terraform: - openmetadata_s3 in ../../../modules/aws/openmetadata/s3
19:44:49.823 INFO   [aws] terraform: - openmetadata_secretmanager in ../../../modules/aws/openmetadata/secrets_manager
19:44:49.823 INFO   [aws] terraform: - openmetadata_security_group in ../../../modules/aws/openmetadata/security_group
19:44:49.826 INFO   [aws] terraform: Initializing provider plugins...
19:44:49.826 INFO   [aws] terraform: - terraform.io/builtin/terraform is built in to Terraform
19:44:49.826 INFO   [aws] terraform: - Finding latest version of hashicorp/tls...
19:44:49.985 INFO   [aws] terraform: - Finding hashicorp/aws versions matching "~> 6.0.0"...
19:44:50.080 INFO   [aws] terraform: - Finding hashicorp/http versions matching "~> 3.5.0"...
19:44:50.178 INFO   [aws] terraform: - Finding hashicorp/random versions matching "~> 3.7.2"...
19:44:50.235 INFO   [aws] terraform: - Finding latest version of hashicorp/archive...
19:44:50.469 INFO   [aws] terraform: - Installing hashicorp/tls v4.1.0...
19:44:50.855 INFO   [aws] terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
19:44:50.998 INFO   [aws] terraform: - Installing hashicorp/aws v6.0.0...
19:44:56.915 INFO   [aws] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
19:44:57.102 INFO   [aws] terraform: - Installing hashicorp/http v3.5.0...
19:44:57.411 INFO   [aws] terraform: - Installed hashicorp/http v3.5.0 (signed by HashiCorp)
19:44:57.538 INFO   [aws] terraform: - Installing hashicorp/random v3.7.2...
19:44:57.848 INFO   [aws] terraform: - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
19:44:58.012 INFO   [aws] terraform: - Installing hashicorp/archive v2.7.1...
19:44:58.316 INFO   [aws] terraform: - Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
19:44:58.316 INFO   [aws] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
19:44:58.316 INFO   [aws] terraform: selections it made above. Include this file in your version control repository
19:44:58.317 INFO   [aws] terraform: so that Terraform can guarantee to make the same selections by default when
19:44:58.317 INFO   [aws] terraform: you run "terraform init" in the future.
19:44:58.317 INFO   [aws] terraform: Terraform has been successfully initialized!
19:44:58.320 INFO   [aws] Executing hook: fmt
19:44:58.348 INFO   [aws] Executing hook: validate
Success! The configuration is valid.

19:45:04.759 STDOUT [aws] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Reading...
19:45:04.763 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Reading...
19:45:04.763 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Reading...
19:45:04.763 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Reading...
19:45:04.783 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.elasticsearch: Read complete after 0s [id=f62ce6c9a0b28ae85ca6036530a83322a521e75a]
19:45:04.820 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.ingestion: Read complete after 0s [id=953300813302d3d51dc4e2d89abdacc73c5bc2d8]
19:45:04.841 STDOUT [aws] terraform: module.openmetadata_ecr.data.archive_file.openmetadata: Read complete after 0s [id=e3dad56dcd742d40c50096c7078b7867f2903cdb]
19:45:04.874 STDOUT [aws] terraform: module.iam_github_oidc.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
19:45:04.879 STDOUT [aws] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Reading...
19:45:04.981 STDOUT [aws] terraform: module.iam_github_oidc.data.tls_certificate.github_actions: Read complete after 0s [id=772ed8785f2c647baa040d3a1b4aa6cafacb6267]
19:45:05.484 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Reading...
19:45:05.484 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Reading...
19:45:05.484 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Reading...
19:45:05.491 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Reading...
19:45:05.500 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
19:45:05.500 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Reading...
19:45:05.502 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
19:45:05.646 STDOUT [aws] terraform: module.openmetadata_ecs.data.aws_caller_identity.current: Read complete after 1s [id=921407950230]
19:45:05.797 STDOUT [aws] terraform: module.openmetadata_ecr.data.aws_caller_identity.current: Read complete after 1s [id=921407950230]
19:45:05.948 STDOUT [aws] terraform: module.openmetadata_iam.data.aws_caller_identity.current: Read complete after 1s [id=921407950230]
19:45:06.170 STDOUT [aws] terraform: Terraform used the selected providers to generate the following execution
19:45:06.171 STDOUT [aws] terraform: plan. Resource actions are indicated with the following symbols:
19:45:06.171 STDOUT [aws] terraform:   + create
19:45:06.171 STDOUT [aws] terraform: Terraform will perform the following actions:
19:45:06.171 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_openid_connect_provider.this will be created
19:45:06.171 STDOUT [aws] terraform:   + resource "aws_iam_openid_connect_provider" "this" {
19:45:06.171 STDOUT [aws] terraform:       + arn             = (known after apply)
19:45:06.171 STDOUT [aws] terraform:       + client_id_list  = [
19:45:06.171 STDOUT [aws] terraform:           + "sts.amazonaws.com",
19:45:06.171 STDOUT [aws] terraform:         ]
19:45:06.171 STDOUT [aws] terraform:       + id              = (known after apply)
19:45:06.171 STDOUT [aws] terraform:       + tags_all        = (known after apply)
19:45:06.171 STDOUT [aws] terraform:       + thumbprint_list = [
19:45:06.171 STDOUT [aws] terraform:           + "2b18947a6a9fc7764fd8b5fb18a863b0c6dac24f",
19:45:06.172 STDOUT [aws] terraform:           + "dd55b4520291e276588f0dd02fafd83a7368e0fa",
19:45:06.172 STDOUT [aws] terraform:           + "7560d6f40fa55195f740ee2b1b7c0b4836cbe103",
19:45:06.172 STDOUT [aws] terraform:         ]
19:45:06.172 STDOUT [aws] terraform:       + url             = "https://token.actions.githubusercontent.com"
19:45:06.172 STDOUT [aws] terraform:     }
19:45:06.172 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_role.this will be created
19:45:06.172 STDOUT [aws] terraform:   + resource "aws_iam_role" "this" {
19:45:06.172 STDOUT [aws] terraform:       + arn                   = (known after apply)
19:45:06.172 STDOUT [aws] terraform:       + assume_role_policy    = (known after apply)
19:45:06.172 STDOUT [aws] terraform:       + create_date           = (known after apply)
19:45:06.172 STDOUT [aws] terraform:       + force_detach_policies = false
19:45:06.172 STDOUT [aws] terraform:       + id                    = (known after apply)
19:45:06.172 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)
19:45:06.172 STDOUT [aws] terraform:       + max_session_duration  = 3600
19:45:06.172 STDOUT [aws] terraform:       + name                  = "ethan-dev-iamrole-apne1-oidc"
19:45:06.173 STDOUT [aws] terraform:       + name_prefix           = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + path                  = "/"
19:45:06.173 STDOUT [aws] terraform:       + tags_all              = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + unique_id             = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + inline_policy (known after apply)
19:45:06.173 STDOUT [aws] terraform:     }
19:45:06.173 STDOUT [aws] terraform:   # module.iam_github_oidc.aws_iam_role_policy_attachment.this will be created
19:45:06.173 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "this" {
19:45:06.173 STDOUT [aws] terraform:       + id         = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
19:45:06.173 STDOUT [aws] terraform:       + role       = "ethan-dev-iamrole-apne1-oidc"
19:45:06.173 STDOUT [aws] terraform:     }
19:45:06.173 STDOUT [aws] terraform:   # module.network.aws_default_network_acl.default will be created
19:45:06.173 STDOUT [aws] terraform:   + resource "aws_default_network_acl" "default" {
19:45:06.173 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + default_network_acl_id = (known after apply)
19:45:06.173 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.174 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.174 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.174 STDOUT [aws] terraform:       + subnet_ids             = (known after apply)
19:45:06.174 STDOUT [aws] terraform:       + tags                   = {
19:45:06.174 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"
19:45:06.174 STDOUT [aws] terraform:         }
19:45:06.174 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.174 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nacl-default"
19:45:06.174 STDOUT [aws] terraform:         }
19:45:06.174 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.174 STDOUT [aws] terraform:       + egress {
19:45:06.174 STDOUT [aws] terraform:           + action          = "allow"
19:45:06.174 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"
19:45:06.174 STDOUT [aws] terraform:           + from_port       = 0
19:45:06.174 STDOUT [aws] terraform:           + icmp_code       = 0
19:45:06.174 STDOUT [aws] terraform:           + icmp_type       = 0
19:45:06.174 STDOUT [aws] terraform:           + protocol        = "-1"
19:45:06.174 STDOUT [aws] terraform:           + rule_no         = 100
19:45:06.175 STDOUT [aws] terraform:           + to_port         = 0
19:45:06.175 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
19:45:06.175 STDOUT [aws] terraform:         }
19:45:06.175 STDOUT [aws] terraform:       + ingress {
19:45:06.175 STDOUT [aws] terraform:           + action          = "allow"
19:45:06.175 STDOUT [aws] terraform:           + cidr_block      = "0.0.0.0/0"
19:45:06.175 STDOUT [aws] terraform:           + from_port       = 0
19:45:06.175 STDOUT [aws] terraform:           + icmp_code       = 0
19:45:06.175 STDOUT [aws] terraform:           + icmp_type       = 0
19:45:06.175 STDOUT [aws] terraform:           + protocol        = "-1"
19:45:06.175 STDOUT [aws] terraform:           + rule_no         = 100
19:45:06.175 STDOUT [aws] terraform:           + to_port         = 0
19:45:06.175 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
19:45:06.175 STDOUT [aws] terraform:         }
19:45:06.175 STDOUT [aws] terraform:     }
19:45:06.175 STDOUT [aws] terraform:   # module.network.aws_default_route_table.default will be created
19:45:06.175 STDOUT [aws] terraform:   + resource "aws_default_route_table" "default" {
19:45:06.175 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.175 STDOUT [aws] terraform:       + default_route_table_id = (known after apply)
19:45:06.175 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.176 STDOUT [aws] terraform:       + route                  = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + tags_all               = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.176 STDOUT [aws] terraform:     }
19:45:06.176 STDOUT [aws] terraform:   # module.network.aws_default_security_group.sg_default will be created
19:45:06.176 STDOUT [aws] terraform:   + resource "aws_default_security_group" "sg_default" {
19:45:06.176 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + description            = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + egress                 = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + ingress                = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + name                   = (known after apply)
19:45:06.176 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.177 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
19:45:06.177 STDOUT [aws] terraform:       + tags                   = {
19:45:06.177 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"
19:45:06.177 STDOUT [aws] terraform:         }
19:45:06.177 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.177 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-default"
19:45:06.177 STDOUT [aws] terraform:         }
19:45:06.177 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.177 STDOUT [aws] terraform:     }
19:45:06.177 STDOUT [aws] terraform:   # module.network.aws_eip.nat_a will be created
19:45:06.177 STDOUT [aws] terraform:   + resource "aws_eip" "nat_a" {
19:45:06.177 STDOUT [aws] terraform:       + allocation_id        = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + association_id       = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)
19:45:06.177 STDOUT [aws] terraform:       + domain               = "vpc"
19:45:06.178 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + instance             = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + network_border_group = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + network_interface    = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + private_dns          = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + private_ip           = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + ptr_record           = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + public_dns           = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + public_ip            = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)
19:45:06.178 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.178 STDOUT [aws] terraform:       + tags                 = {
19:45:06.178 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"
19:45:06.178 STDOUT [aws] terraform:         }
19:45:06.178 STDOUT [aws] terraform:       + tags_all             = {
19:45:06.178 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-a"
19:45:06.179 STDOUT [aws] terraform:         }
19:45:06.179 STDOUT [aws] terraform:     }
19:45:06.179 STDOUT [aws] terraform:   # module.network.aws_eip.nat_c will be created
19:45:06.179 STDOUT [aws] terraform:   + resource "aws_eip" "nat_c" {
19:45:06.179 STDOUT [aws] terraform:       + allocation_id        = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + association_id       = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + carrier_ip           = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + customer_owned_ip    = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + domain               = "vpc"
19:45:06.179 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + instance             = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + ipam_pool_id         = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + network_border_group = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + network_interface    = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + private_dns          = (known after apply)
19:45:06.179 STDOUT [aws] terraform:       + private_ip           = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + ptr_record           = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + public_dns           = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + public_ip            = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + public_ipv4_pool     = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.180 STDOUT [aws] terraform:       + tags                 = {
19:45:06.180 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"
19:45:06.180 STDOUT [aws] terraform:         }
19:45:06.180 STDOUT [aws] terraform:       + tags_all             = {
19:45:06.180 STDOUT [aws] terraform:           + "Name" = "ethan-dev-eip-apne1-nat-c"
19:45:06.180 STDOUT [aws] terraform:         }
19:45:06.180 STDOUT [aws] terraform:     }
19:45:06.180 STDOUT [aws] terraform:   # module.network.aws_internet_gateway.this will be created
19:45:06.180 STDOUT [aws] terraform:   + resource "aws_internet_gateway" "this" {
19:45:06.180 STDOUT [aws] terraform:       + arn      = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + id       = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + owner_id = (known after apply)
19:45:06.180 STDOUT [aws] terraform:       + region   = "ap-northeast-1"
19:45:06.180 STDOUT [aws] terraform:       + tags     = {
19:45:06.181 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"
19:45:06.181 STDOUT [aws] terraform:         }
19:45:06.181 STDOUT [aws] terraform:       + tags_all = {
19:45:06.181 STDOUT [aws] terraform:           + "Name" = "ethan-dev-igw-apne1"
19:45:06.181 STDOUT [aws] terraform:         }
19:45:06.181 STDOUT [aws] terraform:       + vpc_id   = (known after apply)
19:45:06.181 STDOUT [aws] terraform:     }
19:45:06.181 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_a will be created
19:45:06.181 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_a" {
19:45:06.181 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + association_id                     = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + connectivity_type                  = "public"
19:45:06.181 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + private_ip                         = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + public_ip                          = (known after apply)
19:45:06.181 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.181 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + tags                               = {
19:45:06.182 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"
19:45:06.182 STDOUT [aws] terraform:         }
19:45:06.182 STDOUT [aws] terraform:       + tags_all                           = {
19:45:06.182 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-a"
19:45:06.182 STDOUT [aws] terraform:         }
19:45:06.182 STDOUT [aws] terraform:     }
19:45:06.182 STDOUT [aws] terraform:   # module.network.aws_nat_gateway.public_c will be created
19:45:06.182 STDOUT [aws] terraform:   + resource "aws_nat_gateway" "public_c" {
19:45:06.182 STDOUT [aws] terraform:       + allocation_id                      = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + association_id                     = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + connectivity_type                  = "public"
19:45:06.182 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + network_interface_id               = (known after apply)
19:45:06.182 STDOUT [aws] terraform:       + private_ip                         = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + public_ip                          = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.183 STDOUT [aws] terraform:       + secondary_private_ip_address_count = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + secondary_private_ip_addresses     = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + subnet_id                          = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + tags                               = {
19:45:06.183 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"
19:45:06.183 STDOUT [aws] terraform:         }
19:45:06.183 STDOUT [aws] terraform:       + tags_all                           = {
19:45:06.183 STDOUT [aws] terraform:           + "Name" = "ethan-dev-nat-apne1-public-c"
19:45:06.183 STDOUT [aws] terraform:         }
19:45:06.183 STDOUT [aws] terraform:     }
19:45:06.183 STDOUT [aws] terraform:   # module.network.aws_route_table.private_a will be created
19:45:06.183 STDOUT [aws] terraform:   + resource "aws_route_table" "private_a" {
19:45:06.183 STDOUT [aws] terraform:       + arn              = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.183 STDOUT [aws] terraform:       + owner_id         = (known after apply)
19:45:06.184 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
19:45:06.184 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
19:45:06.184 STDOUT [aws] terraform:       + route            = [
19:45:06.184 STDOUT [aws] terraform:           + {
19:45:06.184 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
19:45:06.184 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)
19:45:06.184 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
19:45:06.184 STDOUT [aws] terraform:             },
19:45:06.184 STDOUT [aws] terraform:         ]
19:45:06.184 STDOUT [aws] terraform:       + tags             = {
19:45:06.184 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"
19:45:06.184 STDOUT [aws] terraform:         }
19:45:06.184 STDOUT [aws] terraform:       + tags_all         = {
19:45:06.184 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-a"
19:45:06.184 STDOUT [aws] terraform:         }
19:45:06.184 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
19:45:06.184 STDOUT [aws] terraform:     }
19:45:06.184 STDOUT [aws] terraform:   # module.network.aws_route_table.private_c will be created
19:45:06.184 STDOUT [aws] terraform:   + resource "aws_route_table" "private_c" {
19:45:06.184 STDOUT [aws] terraform:       + arn              = (known after apply)
19:45:06.185 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.185 STDOUT [aws] terraform:       + owner_id         = (known after apply)
19:45:06.185 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
19:45:06.185 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
19:45:06.185 STDOUT [aws] terraform:       + route            = [
19:45:06.185 STDOUT [aws] terraform:           + {
19:45:06.185 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
19:45:06.185 STDOUT [aws] terraform:               + nat_gateway_id             = (known after apply)
19:45:06.185 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
19:45:06.185 STDOUT [aws] terraform:             },
19:45:06.185 STDOUT [aws] terraform:         ]
19:45:06.185 STDOUT [aws] terraform:       + tags             = {
19:45:06.185 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"
19:45:06.185 STDOUT [aws] terraform:         }
19:45:06.185 STDOUT [aws] terraform:       + tags_all         = {
19:45:06.185 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-private-c"
19:45:06.185 STDOUT [aws] terraform:         }
19:45:06.185 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
19:45:06.185 STDOUT [aws] terraform:     }
19:45:06.185 STDOUT [aws] terraform:   # module.network.aws_route_table.public will be created
19:45:06.186 STDOUT [aws] terraform:   + resource "aws_route_table" "public" {
19:45:06.186 STDOUT [aws] terraform:       + arn              = (known after apply)
19:45:06.186 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.186 STDOUT [aws] terraform:       + owner_id         = (known after apply)
19:45:06.186 STDOUT [aws] terraform:       + propagating_vgws = (known after apply)
19:45:06.186 STDOUT [aws] terraform:       + region           = "ap-northeast-1"
19:45:06.186 STDOUT [aws] terraform:       + route            = [
19:45:06.186 STDOUT [aws] terraform:           + {
19:45:06.186 STDOUT [aws] terraform:               + cidr_block                 = "0.0.0.0/0"
19:45:06.186 STDOUT [aws] terraform:               + gateway_id                 = (known after apply)
19:45:06.186 STDOUT [aws] terraform:                 # (11 unchanged attributes hidden)
19:45:06.186 STDOUT [aws] terraform:             },
19:45:06.186 STDOUT [aws] terraform:         ]
19:45:06.186 STDOUT [aws] terraform:       + tags             = {
19:45:06.186 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"
19:45:06.186 STDOUT [aws] terraform:         }
19:45:06.186 STDOUT [aws] terraform:       + tags_all         = {
19:45:06.186 STDOUT [aws] terraform:           + "Name" = "ethan-dev-rtb-apne1-public"
19:45:06.187 STDOUT [aws] terraform:         }
19:45:06.187 STDOUT [aws] terraform:       + vpc_id           = (known after apply)
19:45:06.187 STDOUT [aws] terraform:     }
19:45:06.187 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_a will be created
19:45:06.187 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_a" {
19:45:06.187 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.187 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.187 STDOUT [aws] terraform:       + route_table_id = (known after apply)
19:45:06.187 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
19:45:06.187 STDOUT [aws] terraform:     }
19:45:06.187 STDOUT [aws] terraform:   # module.network.aws_route_table_association.private_c will be created
19:45:06.187 STDOUT [aws] terraform:   + resource "aws_route_table_association" "private_c" {
19:45:06.187 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.187 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.187 STDOUT [aws] terraform:       + route_table_id = (known after apply)
19:45:06.187 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
19:45:06.187 STDOUT [aws] terraform:     }
19:45:06.187 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_a will be created
19:45:06.187 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_a" {
19:45:06.188 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.188 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.188 STDOUT [aws] terraform:       + route_table_id = (known after apply)
19:45:06.188 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
19:45:06.188 STDOUT [aws] terraform:     }
19:45:06.188 STDOUT [aws] terraform:   # module.network.aws_route_table_association.public_c will be created
19:45:06.188 STDOUT [aws] terraform:   + resource "aws_route_table_association" "public_c" {
19:45:06.188 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.188 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.188 STDOUT [aws] terraform:       + route_table_id = (known after apply)
19:45:06.188 STDOUT [aws] terraform:       + subnet_id      = (known after apply)
19:45:06.188 STDOUT [aws] terraform:     }
19:45:06.188 STDOUT [aws] terraform:   # module.network.aws_security_group.self_reference will be created
19:45:06.188 STDOUT [aws] terraform:   + resource "aws_security_group" "self_reference" {
19:45:06.188 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.188 STDOUT [aws] terraform:       + description            = "self-reference"
19:45:06.188 STDOUT [aws] terraform:       + egress                 = [
19:45:06.188 STDOUT [aws] terraform:           + {
19:45:06.189 STDOUT [aws] terraform:               + cidr_blocks      = [
19:45:06.189 STDOUT [aws] terraform:                   + "10.0.0.0/16",
19:45:06.189 STDOUT [aws] terraform:                 ]
19:45:06.189 STDOUT [aws] terraform:               + from_port        = 0
19:45:06.189 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.189 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.189 STDOUT [aws] terraform:               + protocol         = "-1"
19:45:06.189 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.189 STDOUT [aws] terraform:               + self             = false
19:45:06.189 STDOUT [aws] terraform:               + to_port          = 0
19:45:06.189 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.189 STDOUT [aws] terraform:             },
19:45:06.189 STDOUT [aws] terraform:         ]
19:45:06.189 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.189 STDOUT [aws] terraform:       + ingress                = [
19:45:06.189 STDOUT [aws] terraform:           + {
19:45:06.189 STDOUT [aws] terraform:               + cidr_blocks      = []
19:45:06.189 STDOUT [aws] terraform:               + from_port        = 0
19:45:06.189 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.189 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.190 STDOUT [aws] terraform:               + protocol         = "-1"
19:45:06.190 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.190 STDOUT [aws] terraform:               + self             = true
19:45:06.190 STDOUT [aws] terraform:               + to_port          = 0
19:45:06.190 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.190 STDOUT [aws] terraform:             },
19:45:06.190 STDOUT [aws] terraform:         ]
19:45:06.190 STDOUT [aws] terraform:       + name                   = "ethan-dev-sg-self-reference"
19:45:06.190 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
19:45:06.190 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.190 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.190 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
19:45:06.190 STDOUT [aws] terraform:       + tags                   = {
19:45:06.190 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"
19:45:06.190 STDOUT [aws] terraform:         }
19:45:06.190 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.190 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-self-reference"
19:45:06.190 STDOUT [aws] terraform:         }
19:45:06.190 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.191 STDOUT [aws] terraform:     }
19:45:06.191 STDOUT [aws] terraform:   # module.network.aws_subnet.private_a will be created
19:45:06.191 STDOUT [aws] terraform:   + resource "aws_subnet" "private_a" {
19:45:06.191 STDOUT [aws] terraform:       + arn                                            = (known after apply)
19:45:06.191 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
19:45:06.191 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"
19:45:06.191 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
19:45:06.191 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.10.0/24"
19:45:06.191 STDOUT [aws] terraform:       + enable_dns64                                   = false
19:45:06.191 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
19:45:06.191 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
19:45:06.191 STDOUT [aws] terraform:       + id                                             = (known after apply)
19:45:06.191 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
19:45:06.191 STDOUT [aws] terraform:       + ipv6_native                                    = false
19:45:06.192 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
19:45:06.192 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
19:45:06.192 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
19:45:06.192 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
19:45:06.192 STDOUT [aws] terraform:       + tags                                           = {
19:45:06.192 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"
19:45:06.192 STDOUT [aws] terraform:         }
19:45:06.192 STDOUT [aws] terraform:       + tags_all                                       = {
19:45:06.192 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-a"
19:45:06.192 STDOUT [aws] terraform:         }
19:45:06.192 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
19:45:06.192 STDOUT [aws] terraform:     }
19:45:06.192 STDOUT [aws] terraform:   # module.network.aws_subnet.private_c will be created
19:45:06.192 STDOUT [aws] terraform:   + resource "aws_subnet" "private_c" {
19:45:06.192 STDOUT [aws] terraform:       + arn                                            = (known after apply)
19:45:06.192 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
19:45:06.193 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"
19:45:06.193 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
19:45:06.193 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.11.0/24"
19:45:06.193 STDOUT [aws] terraform:       + enable_dns64                                   = false
19:45:06.193 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
19:45:06.193 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
19:45:06.193 STDOUT [aws] terraform:       + id                                             = (known after apply)
19:45:06.193 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
19:45:06.193 STDOUT [aws] terraform:       + ipv6_native                                    = false
19:45:06.193 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
19:45:06.193 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
19:45:06.193 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
19:45:06.193 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
19:45:06.194 STDOUT [aws] terraform:       + tags                                           = {
19:45:06.194 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"
19:45:06.194 STDOUT [aws] terraform:         }
19:45:06.194 STDOUT [aws] terraform:       + tags_all                                       = {
19:45:06.194 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-private-c"
19:45:06.194 STDOUT [aws] terraform:         }
19:45:06.194 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
19:45:06.194 STDOUT [aws] terraform:     }
19:45:06.194 STDOUT [aws] terraform:   # module.network.aws_subnet.public_a will be created
19:45:06.194 STDOUT [aws] terraform:   + resource "aws_subnet" "public_a" {
19:45:06.194 STDOUT [aws] terraform:       + arn                                            = (known after apply)
19:45:06.194 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
19:45:06.194 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1a"
19:45:06.194 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
19:45:06.194 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.0.0/24"
19:45:06.194 STDOUT [aws] terraform:       + enable_dns64                                   = false
19:45:06.194 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
19:45:06.195 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
19:45:06.195 STDOUT [aws] terraform:       + id                                             = (known after apply)
19:45:06.195 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
19:45:06.195 STDOUT [aws] terraform:       + ipv6_native                                    = false
19:45:06.195 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
19:45:06.195 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
19:45:06.195 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
19:45:06.195 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
19:45:06.195 STDOUT [aws] terraform:       + tags                                           = {
19:45:06.195 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"
19:45:06.195 STDOUT [aws] terraform:         }
19:45:06.195 STDOUT [aws] terraform:       + tags_all                                       = {
19:45:06.195 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-a"
19:45:06.195 STDOUT [aws] terraform:         }
19:45:06.195 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
19:45:06.196 STDOUT [aws] terraform:     }
19:45:06.196 STDOUT [aws] terraform:   # module.network.aws_subnet.public_c will be created
19:45:06.196 STDOUT [aws] terraform:   + resource "aws_subnet" "public_c" {
19:45:06.196 STDOUT [aws] terraform:       + arn                                            = (known after apply)
19:45:06.196 STDOUT [aws] terraform:       + assign_ipv6_address_on_creation                = false
19:45:06.196 STDOUT [aws] terraform:       + availability_zone                              = "ap-northeast-1c"
19:45:06.196 STDOUT [aws] terraform:       + availability_zone_id                           = (known after apply)
19:45:06.196 STDOUT [aws] terraform:       + cidr_block                                     = "10.0.1.0/24"
19:45:06.196 STDOUT [aws] terraform:       + enable_dns64                                   = false
19:45:06.196 STDOUT [aws] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
19:45:06.196 STDOUT [aws] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
19:45:06.196 STDOUT [aws] terraform:       + id                                             = (known after apply)
19:45:06.196 STDOUT [aws] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
19:45:06.197 STDOUT [aws] terraform:       + ipv6_native                                    = false
19:45:06.197 STDOUT [aws] terraform:       + map_public_ip_on_launch                        = false
19:45:06.197 STDOUT [aws] terraform:       + owner_id                                       = (known after apply)
19:45:06.197 STDOUT [aws] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
19:45:06.197 STDOUT [aws] terraform:       + region                                         = "ap-northeast-1"
19:45:06.197 STDOUT [aws] terraform:       + tags                                           = {
19:45:06.197 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"
19:45:06.197 STDOUT [aws] terraform:         }
19:45:06.197 STDOUT [aws] terraform:       + tags_all                                       = {
19:45:06.197 STDOUT [aws] terraform:           + "Name" = "ethan-dev-subnet-apne1-public-c"
19:45:06.197 STDOUT [aws] terraform:         }
19:45:06.197 STDOUT [aws] terraform:       + vpc_id                                         = (known after apply)
19:45:06.197 STDOUT [aws] terraform:     }
19:45:06.197 STDOUT [aws] terraform:   # module.network.aws_vpc.this will be created
19:45:06.197 STDOUT [aws] terraform:   + resource "aws_vpc" "this" {
19:45:06.197 STDOUT [aws] terraform:       + arn                                  = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + cidr_block                           = "10.0.0.0/16"
19:45:06.198 STDOUT [aws] terraform:       + default_network_acl_id               = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + default_route_table_id               = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + default_security_group_id            = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + dhcp_options_id                      = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + enable_dns_hostnames                 = true
19:45:06.198 STDOUT [aws] terraform:       + enable_dns_support                   = true
19:45:06.198 STDOUT [aws] terraform:       + enable_network_address_usage_metrics = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + id                                   = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + instance_tenancy                     = "default"
19:45:06.198 STDOUT [aws] terraform:       + ipv6_association_id                  = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + ipv6_cidr_block                      = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
19:45:06.198 STDOUT [aws] terraform:       + main_route_table_id                  = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + owner_id                             = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + region                               = "ap-northeast-1"
19:45:06.199 STDOUT [aws] terraform:       + tags                                 = {
19:45:06.199 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"
19:45:06.199 STDOUT [aws] terraform:         }
19:45:06.199 STDOUT [aws] terraform:       + tags_all                             = {
19:45:06.199 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpc-apne1"
19:45:06.199 STDOUT [aws] terraform:         }
19:45:06.199 STDOUT [aws] terraform:     }
19:45:06.199 STDOUT [aws] terraform:   # module.network.aws_vpc_endpoint.s3 will be created
19:45:06.199 STDOUT [aws] terraform:   + resource "aws_vpc_endpoint" "s3" {
19:45:06.199 STDOUT [aws] terraform:       + arn                   = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + cidr_blocks           = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + dns_entry             = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + id                    = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + ip_address_type       = (known after apply)
19:45:06.199 STDOUT [aws] terraform:       + network_interface_ids = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + owner_id              = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + policy                = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + prefix_list_id        = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + private_dns_enabled   = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + region                = "ap-northeast-1"
19:45:06.200 STDOUT [aws] terraform:       + requester_managed     = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + route_table_ids       = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + security_group_ids    = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + service_name          = "com.amazonaws.ap-northeast-1.s3"
19:45:06.200 STDOUT [aws] terraform:       + service_region        = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + state                 = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + subnet_ids            = (known after apply)
19:45:06.200 STDOUT [aws] terraform:       + tags                  = {
19:45:06.200 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"
19:45:06.200 STDOUT [aws] terraform:         }
19:45:06.200 STDOUT [aws] terraform:       + tags_all              = {
19:45:06.201 STDOUT [aws] terraform:           + "Name" = "ethan-dev-vpce-apne1-s3"
19:45:06.201 STDOUT [aws] terraform:         }
19:45:06.201 STDOUT [aws] terraform:       + vpc_endpoint_type     = "Gateway"
19:45:06.201 STDOUT [aws] terraform:       + vpc_id                = (known after apply)
19:45:06.201 STDOUT [aws] terraform:       + dns_options (known after apply)
19:45:06.201 STDOUT [aws] terraform:       + subnet_configuration (known after apply)
19:45:06.201 STDOUT [aws] terraform:     }
19:45:06.201 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_db_subnet_group.aurora_group will be created
19:45:06.201 STDOUT [aws] terraform:   + resource "aws_db_subnet_group" "aurora_group" {
19:45:06.201 STDOUT [aws] terraform:       + arn                     = (known after apply)
19:45:06.201 STDOUT [aws] terraform:       + description             = "Managed by Terraform"
19:45:06.201 STDOUT [aws] terraform:       + id                      = (known after apply)
19:45:06.201 STDOUT [aws] terraform:       + name                    = "ethan-dev-aurora-apne1-subnet-group"
19:45:06.201 STDOUT [aws] terraform:       + name_prefix             = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"
19:45:06.202 STDOUT [aws] terraform:       + subnet_ids              = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + supported_network_types = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + tags_all                = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + vpc_id                  = (known after apply)
19:45:06.202 STDOUT [aws] terraform:     }
19:45:06.202 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster.aurora will be created
19:45:06.202 STDOUT [aws] terraform:   + resource "aws_rds_cluster" "aurora" {
19:45:06.202 STDOUT [aws] terraform:       + allocated_storage                     = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + arn                                   = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + availability_zones                    = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + backup_retention_period               = 1
19:45:06.202 STDOUT [aws] terraform:       + ca_certificate_identifier             = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + ca_certificate_valid_till             = (known after apply)
19:45:06.202 STDOUT [aws] terraform:       + cluster_identifier                    = "ethan-dev-aurora-apne1-cluster"
19:45:06.203 STDOUT [aws] terraform:       + cluster_identifier_prefix             = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + cluster_members                       = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + cluster_resource_id                   = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + cluster_scalability_type              = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false
19:45:06.203 STDOUT [aws] terraform:       + database_insights_mode                = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + database_name                         = "openmetadata"
19:45:06.203 STDOUT [aws] terraform:       + db_cluster_parameter_group_name       = "ethan-dev-aurora-apne1-param-group"
19:45:06.203 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"
19:45:06.203 STDOUT [aws] terraform:       + db_system_id                          = (known after apply)
19:45:06.203 STDOUT [aws] terraform:       + delete_automated_backups              = true
19:45:06.203 STDOUT [aws] terraform:       + deletion_protection                   = true
19:45:06.203 STDOUT [aws] terraform:       + enable_global_write_forwarding        = false
19:45:06.204 STDOUT [aws] terraform:       + enable_http_endpoint                  = true
19:45:06.204 STDOUT [aws] terraform:       + enable_local_write_forwarding         = false
19:45:06.204 STDOUT [aws] terraform:       + enabled_cloudwatch_logs_exports       = [
19:45:06.204 STDOUT [aws] terraform:           + "postgresql",
19:45:06.204 STDOUT [aws] terraform:         ]
19:45:06.204 STDOUT [aws] terraform:       + endpoint                              = (known after apply)
19:45:06.204 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"
19:45:06.204 STDOUT [aws] terraform:       + engine_lifecycle_support              = (known after apply)
19:45:06.204 STDOUT [aws] terraform:       + engine_mode                           = "provisioned"
19:45:06.204 STDOUT [aws] terraform:       + engine_version                        = "16.2"
19:45:06.204 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)
19:45:06.204 STDOUT [aws] terraform:       + hosted_zone_id                        = (known after apply)
19:45:06.204 STDOUT [aws] terraform:       + iam_database_authentication_enabled   = true
19:45:06.204 STDOUT [aws] terraform:       + iam_roles                             = (known after apply)
19:45:06.204 STDOUT [aws] terraform:       + id                                    = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + master_password                       = (sensitive value)
19:45:06.205 STDOUT [aws] terraform:       + master_password_wo                    = (write-only attribute)
19:45:06.205 STDOUT [aws] terraform:       + master_user_secret                    = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + master_user_secret_kms_key_id         = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + master_username                       = "openmetadata_admin"
19:45:06.205 STDOUT [aws] terraform:       + monitoring_interval                   = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + network_type                          = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)
19:45:06.205 STDOUT [aws] terraform:       + port                                  = (known after apply)
19:45:06.206 STDOUT [aws] terraform:       + preferred_backup_window               = "08:00-08:30"
19:45:06.206 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"
19:45:06.206 STDOUT [aws] terraform:       + reader_endpoint                       = (known after apply)
19:45:06.206 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"
19:45:06.206 STDOUT [aws] terraform:       + skip_final_snapshot                   = true
19:45:06.206 STDOUT [aws] terraform:       + storage_encrypted                     = true
19:45:06.206 STDOUT [aws] terraform:       + storage_type                          = (known after apply)
19:45:06.206 STDOUT [aws] terraform:       + tags_all                              = (known after apply)
19:45:06.206 STDOUT [aws] terraform:       + vpc_security_group_ids                = (known after apply)
19:45:06.206 STDOUT [aws] terraform:       + serverlessv2_scaling_configuration {
19:45:06.206 STDOUT [aws] terraform:           + max_capacity             = 1
19:45:06.206 STDOUT [aws] terraform:           + min_capacity             = 0
19:45:06.206 STDOUT [aws] terraform:           + seconds_until_auto_pause = (known after apply)
19:45:06.206 STDOUT [aws] terraform:         }
19:45:06.206 STDOUT [aws] terraform:     }
19:45:06.206 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_instance.aurora_instance[0] will be created
19:45:06.206 STDOUT [aws] terraform:   + resource "aws_rds_cluster_instance" "aurora_instance" {
19:45:06.207 STDOUT [aws] terraform:       + apply_immediately                     = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + arn                                   = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + auto_minor_version_upgrade            = true
19:45:06.207 STDOUT [aws] terraform:       + availability_zone                     = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + ca_cert_identifier                    = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + cluster_identifier                    = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + copy_tags_to_snapshot                 = false
19:45:06.207 STDOUT [aws] terraform:       + db_parameter_group_name               = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + db_subnet_group_name                  = "ethan-dev-aurora-apne1-subnet-group"
19:45:06.207 STDOUT [aws] terraform:       + dbi_resource_id                       = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + endpoint                              = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + engine                                = "aurora-postgresql"
19:45:06.207 STDOUT [aws] terraform:       + engine_version                        = "16.2"
19:45:06.207 STDOUT [aws] terraform:       + engine_version_actual                 = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + force_destroy                         = false
19:45:06.207 STDOUT [aws] terraform:       + id                                    = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + identifier                            = "ethan-dev-aurora-apne1-instance-0"
19:45:06.207 STDOUT [aws] terraform:       + identifier_prefix                     = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + instance_class                        = "db.serverless"
19:45:06.207 STDOUT [aws] terraform:       + kms_key_id                            = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + monitoring_interval                   = 0
19:45:06.207 STDOUT [aws] terraform:       + monitoring_role_arn                   = (known after apply)
19:45:06.207 STDOUT [aws] terraform:       + network_type                          = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + performance_insights_enabled          = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + performance_insights_kms_key_id       = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + performance_insights_retention_period = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + port                                  = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + preferred_backup_window               = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + preferred_maintenance_window          = "sun:09:00-sun:09:30"
19:45:06.208 STDOUT [aws] terraform:       + promotion_tier                        = 0
19:45:06.208 STDOUT [aws] terraform:       + publicly_accessible                   = false
19:45:06.208 STDOUT [aws] terraform:       + region                                = "ap-northeast-1"
19:45:06.208 STDOUT [aws] terraform:       + storage_encrypted                     = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + tags_all                              = (known after apply)
19:45:06.208 STDOUT [aws] terraform:       + writer                                = (known after apply)
19:45:06.208 STDOUT [aws] terraform:     }
19:45:06.208 STDOUT [aws] terraform:   # module.openmetadata_aurora.aws_rds_cluster_parameter_group.aurora_param will be created
19:45:06.209 STDOUT [aws] terraform:   + resource "aws_rds_cluster_parameter_group" "aurora_param" {
19:45:06.209 STDOUT [aws] terraform:       + arn         = (known after apply)
19:45:06.209 STDOUT [aws] terraform:       + description = "Managed by Terraform"
19:45:06.209 STDOUT [aws] terraform:       + family      = "aurora-postgresql16"
19:45:06.209 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.209 STDOUT [aws] terraform:       + name        = "ethan-dev-aurora-apne1-param-group"
19:45:06.209 STDOUT [aws] terraform:       + name_prefix = (known after apply)
19:45:06.209 STDOUT [aws] terraform:       + region      = "ap-northeast-1"
19:45:06.209 STDOUT [aws] terraform:       + tags_all    = (known after apply)
19:45:06.209 STDOUT [aws] terraform:       + parameter {
19:45:06.209 STDOUT [aws] terraform:           + apply_method = "immediate"
19:45:06.209 STDOUT [aws] terraform:           + name         = "timezone"
19:45:06.209 STDOUT [aws] terraform:           + value        = "Asia/Tokyo"
19:45:06.209 STDOUT [aws] terraform:         }
19:45:06.209 STDOUT [aws] terraform:     }
19:45:06.209 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.elastic_search will be created
19:45:06.209 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "elastic_search" {
19:45:06.209 STDOUT [aws] terraform:       + arn               = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + id                = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + name              = "/aws/ecs/elastic-search"
19:45:06.210 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
19:45:06.210 STDOUT [aws] terraform:       + retention_in_days = 30
19:45:06.210 STDOUT [aws] terraform:       + skip_destroy      = false
19:45:06.210 STDOUT [aws] terraform:       + tags_all          = (known after apply)
19:45:06.210 STDOUT [aws] terraform:     }
19:45:06.210 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.migrate_all will be created
19:45:06.210 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "migrate_all" {
19:45:06.210 STDOUT [aws] terraform:       + arn               = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + id                = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + name              = "/aws/ecs/migrate-all"
19:45:06.210 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
19:45:06.210 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
19:45:06.211 STDOUT [aws] terraform:       + retention_in_days = 30
19:45:06.211 STDOUT [aws] terraform:       + skip_destroy      = false
19:45:06.211 STDOUT [aws] terraform:       + tags_all          = (known after apply)
19:45:06.211 STDOUT [aws] terraform:     }
19:45:06.211 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_airflow will be created
19:45:06.211 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_airflow" {
19:45:06.211 STDOUT [aws] terraform:       + arn               = (known after apply)
19:45:06.211 STDOUT [aws] terraform:       + id                = (known after apply)
19:45:06.211 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
19:45:06.211 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-airflow"
19:45:06.211 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
19:45:06.211 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
19:45:06.211 STDOUT [aws] terraform:       + retention_in_days = 30
19:45:06.211 STDOUT [aws] terraform:       + skip_destroy      = false
19:45:06.211 STDOUT [aws] terraform:       + tags_all          = (known after apply)
19:45:06.211 STDOUT [aws] terraform:     }
19:45:06.211 STDOUT [aws] terraform:   # module.openmetadata_cloudwatch.aws_cloudwatch_log_group.openmetadata_server will be created
19:45:06.212 STDOUT [aws] terraform:   + resource "aws_cloudwatch_log_group" "openmetadata_server" {
19:45:06.212 STDOUT [aws] terraform:       + arn               = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + id                = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + log_group_class   = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + name              = "/aws/ecs/openmetadata-server"
19:45:06.212 STDOUT [aws] terraform:       + name_prefix       = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + region            = "ap-northeast-1"
19:45:06.212 STDOUT [aws] terraform:       + retention_in_days = 30
19:45:06.212 STDOUT [aws] terraform:       + skip_destroy      = false
19:45:06.212 STDOUT [aws] terraform:       + tags_all          = (known after apply)
19:45:06.212 STDOUT [aws] terraform:     }
19:45:06.212 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["elasticsearch"] will be created
19:45:06.212 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
19:45:06.212 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + force_delete         = true
19:45:06.212 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.212 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
19:45:06.213 STDOUT [aws] terraform:       + name                 = "elasticsearch"
19:45:06.213 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.213 STDOUT [aws] terraform:       + registry_id          = (known after apply)
19:45:06.213 STDOUT [aws] terraform:       + repository_url       = (known after apply)
19:45:06.213 STDOUT [aws] terraform:       + tags_all             = (known after apply)
19:45:06.213 STDOUT [aws] terraform:       + encryption_configuration {
19:45:06.213 STDOUT [aws] terraform:           + encryption_type = "KMS"
19:45:06.213 STDOUT [aws] terraform:           + kms_key         = (known after apply)
19:45:06.213 STDOUT [aws] terraform:         }
19:45:06.213 STDOUT [aws] terraform:       + image_scanning_configuration {
19:45:06.213 STDOUT [aws] terraform:           + scan_on_push = true
19:45:06.213 STDOUT [aws] terraform:         }
19:45:06.213 STDOUT [aws] terraform:     }
19:45:06.213 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/ingestion"] will be created
19:45:06.213 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
19:45:06.213 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.213 STDOUT [aws] terraform:       + force_delete         = true
19:45:06.213 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.213 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
19:45:06.214 STDOUT [aws] terraform:       + name                 = "openmetadata/ingestion"
19:45:06.214 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.214 STDOUT [aws] terraform:       + registry_id          = (known after apply)
19:45:06.214 STDOUT [aws] terraform:       + repository_url       = (known after apply)
19:45:06.214 STDOUT [aws] terraform:       + tags_all             = (known after apply)
19:45:06.214 STDOUT [aws] terraform:       + encryption_configuration {
19:45:06.214 STDOUT [aws] terraform:           + encryption_type = "KMS"
19:45:06.214 STDOUT [aws] terraform:           + kms_key         = (known after apply)
19:45:06.214 STDOUT [aws] terraform:         }
19:45:06.214 STDOUT [aws] terraform:       + image_scanning_configuration {
19:45:06.214 STDOUT [aws] terraform:           + scan_on_push = true
19:45:06.214 STDOUT [aws] terraform:         }
19:45:06.214 STDOUT [aws] terraform:     }
19:45:06.214 STDOUT [aws] terraform:   # module.openmetadata_ecr.aws_ecr_repository.openmetadata["openmetadata/server"] will be created
19:45:06.214 STDOUT [aws] terraform:   + resource "aws_ecr_repository" "openmetadata" {
19:45:06.214 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.214 STDOUT [aws] terraform:       + force_delete         = true
19:45:06.214 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.214 STDOUT [aws] terraform:       + image_tag_mutability = "MUTABLE"
19:45:06.215 STDOUT [aws] terraform:       + name                 = "openmetadata/server"
19:45:06.215 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.215 STDOUT [aws] terraform:       + registry_id          = (known after apply)
19:45:06.215 STDOUT [aws] terraform:       + repository_url       = (known after apply)
19:45:06.215 STDOUT [aws] terraform:       + tags_all             = (known after apply)
19:45:06.215 STDOUT [aws] terraform:       + encryption_configuration {
19:45:06.215 STDOUT [aws] terraform:           + encryption_type = "KMS"
19:45:06.215 STDOUT [aws] terraform:           + kms_key         = (known after apply)
19:45:06.215 STDOUT [aws] terraform:         }
19:45:06.215 STDOUT [aws] terraform:       + image_scanning_configuration {
19:45:06.215 STDOUT [aws] terraform:           + scan_on_push = true
19:45:06.215 STDOUT [aws] terraform:         }
19:45:06.215 STDOUT [aws] terraform:     }
19:45:06.215 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_elasticsearch_image will be created
19:45:06.215 STDOUT [aws] terraform:   + resource "terraform_data" "build_elasticsearch_image" {
19:45:06.215 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.215 STDOUT [aws] terraform:       + triggers_replace = [
19:45:06.215 STDOUT [aws] terraform:           + (known after apply),
19:45:06.216 STDOUT [aws] terraform:           + "c5655737279aa8febab6274def5051ea92d00a9d7b2f2520441d13bb01e5c110",
19:45:06.216 STDOUT [aws] terraform:         ]
19:45:06.216 STDOUT [aws] terraform:     }
19:45:06.216 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_ingestion_image will be created
19:45:06.216 STDOUT [aws] terraform:   + resource "terraform_data" "build_ingestion_image" {
19:45:06.216 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.216 STDOUT [aws] terraform:       + triggers_replace = [
19:45:06.216 STDOUT [aws] terraform:           + (known after apply),
19:45:06.216 STDOUT [aws] terraform:           + "7b4c71b5559a5f6489416eac6fb5e910254e00113aa7049045f287320a7f0cec",
19:45:06.216 STDOUT [aws] terraform:         ]
19:45:06.216 STDOUT [aws] terraform:     }
19:45:06.216 STDOUT [aws] terraform:   # module.openmetadata_ecr.terraform_data.build_openmetadata_image will be created
19:45:06.216 STDOUT [aws] terraform:   + resource "terraform_data" "build_openmetadata_image" {
19:45:06.216 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.216 STDOUT [aws] terraform:       + triggers_replace = [
19:45:06.216 STDOUT [aws] terraform:           + (known after apply),
19:45:06.216 STDOUT [aws] terraform:           + "599c51ccbe631608fd6425a568dc977cd22791ac9ea1f720cb5e46bcca14d751",
19:45:06.216 STDOUT [aws] terraform:         ]
19:45:06.216 STDOUT [aws] terraform:     }
19:45:06.216 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_cluster.this will be created
19:45:06.217 STDOUT [aws] terraform:   + resource "aws_ecs_cluster" "this" {
19:45:06.217 STDOUT [aws] terraform:       + arn      = (known after apply)
19:45:06.217 STDOUT [aws] terraform:       + id       = (known after apply)
19:45:06.217 STDOUT [aws] terraform:       + name     = "ethan-dev-ecs-apne1-cluster"
19:45:06.217 STDOUT [aws] terraform:       + region   = "ap-northeast-1"
19:45:06.217 STDOUT [aws] terraform:       + tags_all = (known after apply)
19:45:06.217 STDOUT [aws] terraform:       + setting {
19:45:06.217 STDOUT [aws] terraform:           + name  = "containerInsights"
19:45:06.217 STDOUT [aws] terraform:           + value = "enabled"
19:45:06.217 STDOUT [aws] terraform:         }
19:45:06.217 STDOUT [aws] terraform:     }
19:45:06.217 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_service.this will be created
19:45:06.217 STDOUT [aws] terraform:   + resource "aws_ecs_service" "this" {
19:45:06.217 STDOUT [aws] terraform:       + arn                                = (known after apply)
19:45:06.217 STDOUT [aws] terraform:       + availability_zone_rebalancing      = "DISABLED"
19:45:06.217 STDOUT [aws] terraform:       + cluster                            = (known after apply)
19:45:06.217 STDOUT [aws] terraform:       + deployment_maximum_percent         = 200
19:45:06.217 STDOUT [aws] terraform:       + deployment_minimum_healthy_percent = 100
19:45:06.218 STDOUT [aws] terraform:       + desired_count                      = 1
19:45:06.218 STDOUT [aws] terraform:       + enable_ecs_managed_tags            = false
19:45:06.218 STDOUT [aws] terraform:       + enable_execute_command             = true
19:45:06.218 STDOUT [aws] terraform:       + iam_role                           = (known after apply)
19:45:06.218 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.218 STDOUT [aws] terraform:       + launch_type                        = "FARGATE"
19:45:06.218 STDOUT [aws] terraform:       + name                               = "openmetadata-service"
19:45:06.218 STDOUT [aws] terraform:       + platform_version                   = "LATEST"
19:45:06.218 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.218 STDOUT [aws] terraform:       + scheduling_strategy                = "REPLICA"
19:45:06.218 STDOUT [aws] terraform:       + tags_all                           = (known after apply)
19:45:06.218 STDOUT [aws] terraform:       + task_definition                    = (known after apply)
19:45:06.218 STDOUT [aws] terraform:       + triggers                           = (known after apply)
19:45:06.218 STDOUT [aws] terraform:       + wait_for_steady_state              = true
19:45:06.219 STDOUT [aws] terraform:       + load_balancer {
19:45:06.219 STDOUT [aws] terraform:           + container_name   = "openmetadata_server"
19:45:06.219 STDOUT [aws] terraform:           + container_port   = 8585
19:45:06.219 STDOUT [aws] terraform:           + target_group_arn = (known after apply)
19:45:06.219 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
19:45:06.219 STDOUT [aws] terraform:         }
19:45:06.219 STDOUT [aws] terraform:       + network_configuration {
19:45:06.219 STDOUT [aws] terraform:           + assign_public_ip = false
19:45:06.219 STDOUT [aws] terraform:           + security_groups  = (known after apply)
19:45:06.219 STDOUT [aws] terraform:           + subnets          = (known after apply)
19:45:06.219 STDOUT [aws] terraform:         }
19:45:06.219 STDOUT [aws] terraform:     }
19:45:06.219 STDOUT [aws] terraform:   # module.openmetadata_ecs.aws_ecs_task_definition.openmetadata will be created
19:45:06.219 STDOUT [aws] terraform:   + resource "aws_ecs_task_definition" "openmetadata" {
19:45:06.219 STDOUT [aws] terraform:       + arn                      = (known after apply)
19:45:06.219 STDOUT [aws] terraform:       + arn_without_revision     = (known after apply)
19:45:06.219 STDOUT [aws] terraform:       + container_definitions    = (sensitive value)
19:45:06.219 STDOUT [aws] terraform:       + cpu                      = "8192"
19:45:06.219 STDOUT [aws] terraform:       + enable_fault_injection   = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + execution_role_arn       = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + family                   = "openmetadata"
19:45:06.220 STDOUT [aws] terraform:       + id                       = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + memory                   = "16384"
19:45:06.220 STDOUT [aws] terraform:       + network_mode             = "awsvpc"
19:45:06.220 STDOUT [aws] terraform:       + region                   = "ap-northeast-1"
19:45:06.220 STDOUT [aws] terraform:       + requires_compatibilities = [
19:45:06.220 STDOUT [aws] terraform:           + "FARGATE",
19:45:06.220 STDOUT [aws] terraform:         ]
19:45:06.220 STDOUT [aws] terraform:       + revision                 = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + skip_destroy             = false
19:45:06.220 STDOUT [aws] terraform:       + tags_all                 = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + task_role_arn            = (known after apply)
19:45:06.220 STDOUT [aws] terraform:       + track_latest             = false
19:45:06.220 STDOUT [aws] terraform:       + ephemeral_storage {
19:45:06.221 STDOUT [aws] terraform:           + size_in_gib = 60
19:45:06.221 STDOUT [aws] terraform:         }
19:45:06.221 STDOUT [aws] terraform:       + runtime_platform {
19:45:06.221 STDOUT [aws] terraform:           + operating_system_family = "LINUX"
19:45:06.221 STDOUT [aws] terraform:         }
19:45:06.221 STDOUT [aws] terraform:     }
19:45:06.221 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task will be created
19:45:06.221 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task" {
19:45:06.221 STDOUT [aws] terraform:       + arn              = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + attachment_count = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task"
19:45:06.221 STDOUT [aws] terraform:       + name_prefix      = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + path             = "/"
19:45:06.221 STDOUT [aws] terraform:       + policy           = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + policy_id        = (known after apply)
19:45:06.221 STDOUT [aws] terraform:       + tags_all         = (known after apply)
19:45:06.221 STDOUT [aws] terraform:     }
19:45:06.221 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_policy.ecs_task_execution will be created
19:45:06.222 STDOUT [aws] terraform:   + resource "aws_iam_policy" "ecs_task_execution" {
19:45:06.222 STDOUT [aws] terraform:       + arn              = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + attachment_count = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + name             = "ethan-dev-policy-apne1-ecs-task-execution"
19:45:06.222 STDOUT [aws] terraform:       + name_prefix      = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + path             = "/"
19:45:06.222 STDOUT [aws] terraform:       + policy           = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + policy_id        = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + tags_all         = (known after apply)
19:45:06.222 STDOUT [aws] terraform:     }
19:45:06.222 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task will be created
19:45:06.222 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task" {
19:45:06.222 STDOUT [aws] terraform:       + arn                   = (known after apply)
19:45:06.222 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(
19:45:06.222 STDOUT [aws] terraform:             {
19:45:06.222 STDOUT [aws] terraform:               + Statement = [
19:45:06.223 STDOUT [aws] terraform:                   + {
19:45:06.223 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"
19:45:06.224 STDOUT [aws] terraform:                       + Condition = {
19:45:06.224 STDOUT [aws] terraform:                           + ArnLike      = {
19:45:06.224 STDOUT [aws] terraform:                               + "aws:SourceArn" = "arn:aws:ecs:ap-northeast-1:921407950230:*"
19:45:06.224 STDOUT [aws] terraform:                             }
19:45:06.224 STDOUT [aws] terraform:                           + StringEquals = {
19:45:06.224 STDOUT [aws] terraform:                               + "aws:SourceAccount" = "921407950230"
19:45:06.225 STDOUT [aws] terraform:                             }
19:45:06.225 STDOUT [aws] terraform:                         }
19:45:06.225 STDOUT [aws] terraform:                       + Effect    = "Allow"
19:45:06.225 STDOUT [aws] terraform:                       + Principal = {
19:45:06.225 STDOUT [aws] terraform:                           + Service = [
19:45:06.225 STDOUT [aws] terraform:                               + "ecs-tasks.amazonaws.com",
19:45:06.225 STDOUT [aws] terraform:                             ]
19:45:06.226 STDOUT [aws] terraform:                         }
19:45:06.226 STDOUT [aws] terraform:                     },
19:45:06.226 STDOUT [aws] terraform:                 ]
19:45:06.226 STDOUT [aws] terraform:               + Version   = "2012-10-17"
19:45:06.226 STDOUT [aws] terraform:             }
19:45:06.226 STDOUT [aws] terraform:         )
19:45:06.226 STDOUT [aws] terraform:       + create_date           = (known after apply)
19:45:06.226 STDOUT [aws] terraform:       + force_detach_policies = false
19:45:06.226 STDOUT [aws] terraform:       + id                    = (known after apply)
19:45:06.226 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)
19:45:06.226 STDOUT [aws] terraform:       + max_session_duration  = 3600
19:45:06.226 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task"
19:45:06.226 STDOUT [aws] terraform:       + name_prefix           = (known after apply)
19:45:06.226 STDOUT [aws] terraform:       + path                  = "/"
19:45:06.226 STDOUT [aws] terraform:       + tags_all              = (known after apply)
19:45:06.226 STDOUT [aws] terraform:       + unique_id             = (known after apply)
19:45:06.227 STDOUT [aws] terraform:       + inline_policy (known after apply)
19:45:06.227 STDOUT [aws] terraform:     }
19:45:06.227 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role.ecs_task_execution will be created
19:45:06.227 STDOUT [aws] terraform:   + resource "aws_iam_role" "ecs_task_execution" {
19:45:06.227 STDOUT [aws] terraform:       + arn                   = (known after apply)
19:45:06.227 STDOUT [aws] terraform:       + assume_role_policy    = jsonencode(
19:45:06.227 STDOUT [aws] terraform:             {
19:45:06.227 STDOUT [aws] terraform:               + Statement = [
19:45:06.227 STDOUT [aws] terraform:                   + {
19:45:06.227 STDOUT [aws] terraform:                       + Action    = "sts:AssumeRole"
19:45:06.227 STDOUT [aws] terraform:                       + Effect    = "Allow"
19:45:06.227 STDOUT [aws] terraform:                       + Principal = {
19:45:06.227 STDOUT [aws] terraform:                           + Service = "ecs-tasks.amazonaws.com"
19:45:06.227 STDOUT [aws] terraform:                         }
19:45:06.227 STDOUT [aws] terraform:                       + Sid       = ""
19:45:06.227 STDOUT [aws] terraform:                     },
19:45:06.227 STDOUT [aws] terraform:                 ]
19:45:06.227 STDOUT [aws] terraform:               + Version   = "2012-10-17"
19:45:06.228 STDOUT [aws] terraform:             }
19:45:06.228 STDOUT [aws] terraform:         )
19:45:06.228 STDOUT [aws] terraform:       + create_date           = (known after apply)
19:45:06.228 STDOUT [aws] terraform:       + force_detach_policies = false
19:45:06.228 STDOUT [aws] terraform:       + id                    = (known after apply)
19:45:06.228 STDOUT [aws] terraform:       + managed_policy_arns   = (known after apply)
19:45:06.228 STDOUT [aws] terraform:       + max_session_duration  = 3600
19:45:06.228 STDOUT [aws] terraform:       + name                  = "ethan-dev-role-apne1-ecs-task-execution"
19:45:06.228 STDOUT [aws] terraform:       + name_prefix           = (known after apply)
19:45:06.228 STDOUT [aws] terraform:       + path                  = "/"
19:45:06.229 STDOUT [aws] terraform:       + tags_all              = (known after apply)
19:45:06.229 STDOUT [aws] terraform:       + unique_id             = (known after apply)
19:45:06.229 STDOUT [aws] terraform:       + inline_policy (known after apply)
19:45:06.229 STDOUT [aws] terraform:     }
19:45:06.229 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task will be created
19:45:06.229 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task" {
19:45:06.229 STDOUT [aws] terraform:       + id         = (known after apply)
19:45:06.229 STDOUT [aws] terraform:       + policy_arn = (known after apply)
19:45:06.230 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task"
19:45:06.230 STDOUT [aws] terraform:     }
19:45:06.230 STDOUT [aws] terraform:   # module.openmetadata_iam.aws_iam_role_policy_attachment.ecs_task_execution will be created
19:45:06.230 STDOUT [aws] terraform:   + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
19:45:06.230 STDOUT [aws] terraform:       + id         = (known after apply)
19:45:06.230 STDOUT [aws] terraform:       + policy_arn = (known after apply)
19:45:06.230 STDOUT [aws] terraform:       + role       = "ethan-dev-role-apne1-ecs-task-execution"
19:45:06.230 STDOUT [aws] terraform:     }
19:45:06.230 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.aurora will be created
19:45:06.231 STDOUT [aws] terraform:   + resource "aws_kms_alias" "aurora" {
19:45:06.231 STDOUT [aws] terraform:       + arn            = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-aurora"
19:45:06.231 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.231 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
19:45:06.231 STDOUT [aws] terraform:     }
19:45:06.231 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.ecr will be created
19:45:06.231 STDOUT [aws] terraform:   + resource "aws_kms_alias" "ecr" {
19:45:06.231 STDOUT [aws] terraform:       + arn            = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-ecr"
19:45:06.231 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
19:45:06.231 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.232 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
19:45:06.232 STDOUT [aws] terraform:     }
19:45:06.232 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_alias.s3 will be created
19:45:06.232 STDOUT [aws] terraform:   + resource "aws_kms_alias" "s3" {
19:45:06.232 STDOUT [aws] terraform:       + arn            = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + name           = "alias/ethan-dev-kms-apne1-s3-envfile"
19:45:06.232 STDOUT [aws] terraform:       + name_prefix    = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.232 STDOUT [aws] terraform:       + target_key_arn = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + target_key_id  = (known after apply)
19:45:06.232 STDOUT [aws] terraform:     }
19:45:06.232 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.aurora will be created
19:45:06.232 STDOUT [aws] terraform:   + resource "aws_kms_key" "aurora" {
19:45:06.232 STDOUT [aws] terraform:       + arn                                = (known after apply)
19:45:06.232 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
19:45:06.232 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
19:45:06.233 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
19:45:06.233 STDOUT [aws] terraform:       + description                        = "For Aurora"
19:45:06.233 STDOUT [aws] terraform:       + enable_key_rotation                = true
19:45:06.233 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.233 STDOUT [aws] terraform:       + is_enabled                         = true
19:45:06.233 STDOUT [aws] terraform:       + key_id                             = (known after apply)
19:45:06.233 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
19:45:06.233 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
19:45:06.233 STDOUT [aws] terraform:       + policy                             = (known after apply)
19:45:06.233 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.233 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
19:45:06.233 STDOUT [aws] terraform:       + tags                               = {
19:45:06.233 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"
19:45:06.233 STDOUT [aws] terraform:         }
19:45:06.233 STDOUT [aws] terraform:       + tags_all                           = {
19:45:06.234 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-aurora"
19:45:06.234 STDOUT [aws] terraform:         }
19:45:06.234 STDOUT [aws] terraform:     }
19:45:06.234 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.ecr will be created
19:45:06.234 STDOUT [aws] terraform:   + resource "aws_kms_key" "ecr" {
19:45:06.234 STDOUT [aws] terraform:       + arn                                = (known after apply)
19:45:06.234 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
19:45:06.234 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
19:45:06.234 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
19:45:06.234 STDOUT [aws] terraform:       + description                        = "For ECR"
19:45:06.234 STDOUT [aws] terraform:       + enable_key_rotation                = true
19:45:06.234 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.234 STDOUT [aws] terraform:       + is_enabled                         = true
19:45:06.234 STDOUT [aws] terraform:       + key_id                             = (known after apply)
19:45:06.234 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
19:45:06.234 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
19:45:06.234 STDOUT [aws] terraform:       + policy                             = (known after apply)
19:45:06.235 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.235 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
19:45:06.235 STDOUT [aws] terraform:       + tags                               = {
19:45:06.235 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"
19:45:06.235 STDOUT [aws] terraform:         }
19:45:06.235 STDOUT [aws] terraform:       + tags_all                           = {
19:45:06.235 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-ecr"
19:45:06.235 STDOUT [aws] terraform:         }
19:45:06.235 STDOUT [aws] terraform:     }
19:45:06.235 STDOUT [aws] terraform:   # module.openmetadata_kms_key.aws_kms_key.s3 will be created
19:45:06.235 STDOUT [aws] terraform:   + resource "aws_kms_key" "s3" {
19:45:06.235 STDOUT [aws] terraform:       + arn                                = (known after apply)
19:45:06.235 STDOUT [aws] terraform:       + bypass_policy_lockout_safety_check = false
19:45:06.235 STDOUT [aws] terraform:       + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
19:45:06.235 STDOUT [aws] terraform:       + deletion_window_in_days            = 7
19:45:06.235 STDOUT [aws] terraform:       [
19:45:06.235 STDOUT [aws] terraform: 32m+ description                        = "For s3"
19:45:06.235 STDOUT [aws] terraform:       + enable_key_rotation                = true
19:45:06.236 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.236 STDOUT [aws] terraform:       + is_enabled                         = true
19:45:06.236 STDOUT [aws] terraform:       + key_id                             = (known after apply)
19:45:06.236 STDOUT [aws] terraform:       + key_usage                          = "ENCRYPT_DECRYPT"
19:45:06.236 STDOUT [aws] terraform:       + multi_region                       = (known after apply)
19:45:06.236 STDOUT [aws] terraform:       + policy                             = (known after apply)
19:45:06.236 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.236 STDOUT [aws] terraform:       + rotation_period_in_days            = 365
19:45:06.236 STDOUT [aws] terraform:       + tags                               = {
19:45:06.236 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"
19:45:06.236 STDOUT [aws] terraform:         }
19:45:06.236 STDOUT [aws] terraform:       + tags_all                           = {
19:45:06.236 STDOUT [aws] terraform:           + "name" = "ethan-dev-kms-apne1-s3-envfile"
19:45:06.236 STDOUT [aws] terraform:         }
19:45:06.236 STDOUT [aws] terraform:     }
19:45:06.236 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb.this will be created
19:45:06.236 STDOUT [aws] terraform:   + resource "aws_lb" "this" {
19:45:06.237 STDOUT [aws] terraform:       + arn                                                          = (known after apply)
19:45:06.237 STDOUT [aws] terraform:       + arn_suffix                                                   = (known after apply)
19:45:06.237 STDOUT [aws] terraform:       + client_keep_alive                                            = 3600
19:45:06.237 STDOUT [aws] terraform:       + desync_mitigation_mode                                       = "defensive"
19:45:06.237 STDOUT [aws] terraform:       + dns_name                                                     = (known after apply)
19:45:06.237 STDOUT [aws] terraform:       + drop_invalid_header_fields                                   = true
19:45:06.237 STDOUT [aws] terraform:       + enable_deletion_protection                                   = false
19:45:06.237 STDOUT [aws] terraform:       + enable_http2                                                 = true
19:45:06.237 STDOUT [aws] terraform:       + enable_tls_version_and_cipher_suite_headers                  = false
19:45:06.237 STDOUT [aws] terraform:       + enable_waf_fail_open                                         = false
19:45:06.237 STDOUT [aws] terraform:       + enable_xff_client_port                                       = false
19:45:06.237 STDOUT [aws] terraform:       + enable_zonal_shift                                           = false
19:45:06.238 STDOUT [aws] terraform:       + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
19:45:06.238 STDOUT [aws] terraform:       + id                                                           = (known after apply)
19:45:06.238 STDOUT [aws] terraform:       + idle_timeout                                                 = 60
19:45:06.238 STDOUT [aws] terraform:       + internal                                                     = (known after apply)
19:45:06.238 STDOUT [aws] terraform:       + ip_address_type                                              = (known after apply)
19:45:06.238 STDOUT [aws] terraform:       + load_balancer_type                                           = "application"
19:45:06.238 STDOUT [aws] terraform:       + name                                                         = "ethan-dev-alb-apne1"
19:45:06.238 STDOUT [aws] terraform:       + name_prefix                                                  = (known after apply)
19:45:06.238 STDOUT [aws] terraform:       + preserve_host_header                                         = false
19:45:06.238 STDOUT [aws] terraform:       + region                                                       = "ap-northeast-1"
19:45:06.238 STDOUT [aws] terraform:       + security_groups                                              = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + subnets                                                      = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + tags_all                                                     = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + vpc_id                                                       = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + xff_header_processing_mode                                   = "append"
19:45:06.239 STDOUT [aws] terraform:       + zone_id                                                      = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + subnet_mapping (known after apply)
19:45:06.239 STDOUT [aws] terraform:     }
19:45:06.239 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_listener.from_https will be created
19:45:06.239 STDOUT [aws] terraform:   + resource "aws_lb_listener" "from_https" {
19:45:06.239 STDOUT [aws] terraform:       + arn                                                                   = (known after apply)
19:45:06.239 STDOUT [aws] terraform:       + certificate_arn                                                       = "arn:aws:acm:ap-northeast-1:000000000000:certificate/mock"
19:45:06.239 STDOUT [aws] terraform:       + id                                                                    = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + load_balancer_arn                                                     = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + port                                                                  = 443
19:45:06.240 STDOUT [aws] terraform:       + protocol                                                              = "HTTPS"
19:45:06.240 STDOUT [aws] terraform:       + region                                                                = "ap-northeast-1"
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
19:45:06.240 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_access_control_max_age_header_value             = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_content_security_policy_header_value            = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_server_enabled                                  = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_strict_transport_security_header_value          = (known after apply)
19:45:06.241 STDOUT [aws] terraform:       + routing_http_response_x_content_type_options_header_value             = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + routing_http_response_x_frame_options_header_value                    = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + ssl_policy                                                            = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + tags_all                                                              = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + tcp_idle_timeout_seconds                                              = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + default_action {
19:45:06.242 STDOUT [aws] terraform:           + order            = (known after apply)
19:45:06.242 STDOUT [aws] terraform:           + target_group_arn = (known after apply)
19:45:06.242 STDOUT [aws] terraform:           + type             = "forward"
19:45:06.242 STDOUT [aws] terraform:         }
19:45:06.242 STDOUT [aws] terraform:       + mutual_authentication (known after apply)
19:45:06.242 STDOUT [aws] terraform:     }
19:45:06.242 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_lb_target_group.to_openmetadata will be created
19:45:06.242 STDOUT [aws] terraform:   + resource "aws_lb_target_group" "to_openmetadata" {
19:45:06.242 STDOUT [aws] terraform:       + arn                                = (known after apply)
19:45:06.242 STDOUT [aws] terraform:       + arn_suffix                         = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + connection_termination             = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + deregistration_delay               = "300"
19:45:06.243 STDOUT [aws] terraform:       + id                                 = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + ip_address_type                    = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + lambda_multi_value_headers_enabled = false
19:45:06.243 STDOUT [aws] terraform:       + load_balancer_arns                 = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + load_balancing_algorithm_type      = "least_outstanding_requests"
19:45:06.243 STDOUT [aws] terraform:       + load_balancing_anomaly_mitigation  = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + load_balancing_cross_zone_enabled  = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + name                               = "openmetadata-tg"
19:45:06.243 STDOUT [aws] terraform:       + name_prefix                        = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + port                               = 8585
19:45:06.243 STDOUT [aws] terraform:       + preserve_client_ip                 = (known after apply)
19:45:06.243 STDOUT [aws] terraform:       + protocol                           = "HTTP"
19:45:06.243 STDOUT [aws] terraform:       + protocol_version                   = (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + proxy_protocol_v2                  = false
19:45:06.244 STDOUT [aws] terraform:       + region                             = "ap-northeast-1"
19:45:06.244 STDOUT [aws] terraform:       + slow_start                         = 0
19:45:06.244 STDOUT [aws] terraform:       + tags_all                           = (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + target_type                        = "ip"
19:45:06.244 STDOUT [aws] terraform:       + vpc_id                             = (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + health_check (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + stickiness {
19:45:06.244 STDOUT [aws] terraform:           + cookie_duration = 86400
19:45:06.244 STDOUT [aws] terraform:           + enabled         = true
19:45:06.244 STDOUT [aws] terraform:           + type            = "lb_cookie"
19:45:06.244 STDOUT [aws] terraform:         }
19:45:06.244 STDOUT [aws] terraform:       + target_failover (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + target_group_health (known after apply)
19:45:06.244 STDOUT [aws] terraform:       + target_health_state (known after apply)
19:45:06.244 STDOUT [aws] terraform:     }
19:45:06.244 STDOUT [aws] terraform:   # module.openmetadata_lb.aws_route53_record.alb_a_record will be created
19:45:06.245 STDOUT [aws] terraform:   + resource "aws_route53_record" "alb_a_record" {
19:45:06.245 STDOUT [aws] terraform:       + allow_overwrite = (known after apply)
19:45:06.245 STDOUT [aws] terraform:       + fqdn            = (known after apply)
19:45:06.245 STDOUT [aws] terraform:       + id              = (known after apply)
19:45:06.245 STDOUT [aws] terraform:       + name            = "ethan-example.com"
19:45:06.245 STDOUT [aws] terraform:       + type            = "A"
19:45:06.245 STDOUT [aws] terraform:       + zone_id         = "Z111111111111"
19:45:06.245 STDOUT [aws] terraform:       + alias {
19:45:06.245 STDOUT [aws] terraform:           + evaluate_target_health = true
19:45:06.245 STDOUT [aws] terraform:           + name                   = (known after apply)
19:45:06.245 STDOUT [aws] terraform:           + zone_id                = (known after apply)
19:45:06.245 STDOUT [aws] terraform:         }
19:45:06.245 STDOUT [aws] terraform:     }
19:45:06.245 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket.this will be created
19:45:06.245 STDOUT [aws] terraform:   + resource "aws_s3_bucket" "this" {
19:45:06.245 STDOUT [aws] terraform:       + acceleration_status         = (known after apply)
19:45:06.245 STDOUT [aws] terraform:       + acl                         = (known after apply)
19:45:06.245 STDOUT [aws] terraform:       + arn                         = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + bucket                      = "ethan-dev-s3-apne1-docker-envfile"
19:45:06.246 STDOUT [aws] terraform:       + bucket_domain_name          = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + bucket_prefix               = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + bucket_region               = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + bucket_regional_domain_name = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + force_destroy               = false
19:45:06.246 STDOUT [aws] terraform:       + hosted_zone_id              = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + id                          = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + object_lock_enabled         = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + policy                      = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + region                      = "ap-northeast-1"
19:45:06.246 STDOUT [aws] terraform:       + request_payer               = (known after apply)
19:45:06.246 STDOUT [aws] terraform:       + tags                        = {
19:45:06.246 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"
19:45:06.246 STDOUT [aws] terraform:         }
19:45:06.246 STDOUT [aws] terraform:       + tags_all                    = {
19:45:06.247 STDOUT [aws] terraform:           + "Name" = "ethan-dev-s3-apne1-docker-envfile"
19:45:06.247 STDOUT [aws] terraform:         }
19:45:06.247 STDOUT [aws] terraform:       + website_domain              = (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + website_endpoint            = (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + cors_rule (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + grant (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + lifecycle_rule (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + logging (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + object_lock_configuration (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + replication_configuration (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + server_side_encryption_configuration (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + versioning (known after apply)
19:45:06.247 STDOUT [aws] terraform:       + website (known after apply)
19:45:06.247 STDOUT [aws] terraform:     }
19:45:06.247 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_policy.this will be created
19:45:06.247 STDOUT [aws] terraform:   + resource "aws_s3_bucket_policy" "this" {
19:45:06.247 STDOUT [aws] terraform:       + bucket = (known after apply)
19:45:06.248 STDOUT [aws] terraform:       + id     = (known after apply)
19:45:06.248 STDOUT [aws] terraform:       + policy = (known after apply)
19:45:06.248 STDOUT [aws] terraform:       + region = "ap-northeast-1"
19:45:06.248 STDOUT [aws] terraform:     }
19:45:06.248 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_public_access_block.this will be created
19:45:06.248 STDOUT [aws] terraform:   + resource "aws_s3_bucket_public_access_block" "this" {
19:45:06.248 STDOUT [aws] terraform:       + block_public_acls       = true
19:45:06.248 STDOUT [aws] terraform:       + block_public_policy     = true
19:45:06.248 STDOUT [aws] terraform:       + bucket                  = (known after apply)
19:45:06.248 STDOUT [aws] terraform:       + id                      = (known after apply)
19:45:06.248 STDOUT [aws] terraform:       + ignore_public_acls      = true
19:45:06.248 STDOUT [aws] terraform:       + region                  = "ap-northeast-1"
19:45:06.248 STDOUT [aws] terraform:       + restrict_public_buckets = true
19:45:06.248 STDOUT [aws] terraform:     }
19:45:06.248 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_server_side_encryption_configuration.this will be created
19:45:06.248 STDOUT [aws] terraform:   + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
19:45:06.248 STDOUT [aws] terraform:       + bucket = (known after apply)
19:45:06.249 STDOUT [aws] terraform:       + id     = (known after apply)
19:45:06.249 STDOUT [aws] terraform:       + region = "ap-northeast-1"
19:45:06.249 STDOUT [aws] terraform:       + rule {
19:45:06.249 STDOUT [aws] terraform:           + apply_server_side_encryption_by_default {
19:45:06.249 STDOUT [aws] terraform:               + kms_master_key_id = (known after apply)
19:45:06.249 STDOUT [aws] terraform:               + sse_algorithm     = "aws:kms"
19:45:06.249 STDOUT [aws] terraform:             }
19:45:06.249 STDOUT [aws] terraform:         }
19:45:06.249 STDOUT [aws] terraform:     }
19:45:06.249 STDOUT [aws] terraform:   # module.openmetadata_s3.aws_s3_bucket_versioning.this will be created
19:45:06.249 STDOUT [aws] terraform:   + resource "aws_s3_bucket_versioning" "this" {
19:45:06.249 STDOUT [aws] terraform:       + bucket = (known after apply)
19:45:06.249 STDOUT [aws] terraform:       + id     = (known after apply)
19:45:06.249 STDOUT [aws] terraform:       + region = "ap-northeast-1"
19:45:06.249 STDOUT [aws] terraform:       + versioning_configuration {
19:45:06.249 STDOUT [aws] terraform:           + mfa_delete = (known after apply)
19:45:06.249 STDOUT [aws] terraform:           + status     = "Enabled"
19:45:06.249 STDOUT [aws] terraform:         }
19:45:06.249 STDOUT [aws] terraform:     }
19:45:06.249 STDOUT [aws] terraform:   # module.openmetadata_s3.terraform_data.copy_docker_environments will be created
19:45:06.249 STDOUT [aws] terraform:   + resource "terraform_data" "copy_docker_environments" {
19:45:06.250 STDOUT [aws] terraform:       + id               = (known after apply)
19:45:06.250 STDOUT [aws] terraform:       + triggers_replace = [
19:45:06.250 STDOUT [aws] terraform:           + (known after apply),
19:45:06.250 STDOUT [aws] terraform:           + "3a92284b199950bde811c42a9dbf742b0622d3d70b59ab164a74db55e4de5b5e",
19:45:06.250 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",
19:45:06.250 STDOUT [aws] terraform:           + "dea6d017571d8236509550f0186053222ac0478072605cf61b9a400823558ad4",
19:45:06.250 STDOUT [aws] terraform:           + "fb3d53fd55bd99861e690d6e6daa2cc288e644c34ff31307a7a64ec0addc73af",
19:45:06.250 STDOUT [aws] terraform:         ]
19:45:06.250 STDOUT [aws] terraform:     }
19:45:06.250 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.aurora will be created
19:45:06.250 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "aurora" {
19:45:06.250 STDOUT [aws] terraform:       + arn                            = (known after apply)
19:45:06.250 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false
19:45:06.250 STDOUT [aws] terraform:       + id                             = (known after apply)
19:45:06.250 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-aurora"
19:45:06.250 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)
19:45:06.251 STDOUT [aws] terraform:       + policy                         = (known after apply)
19:45:06.251 STDOUT [aws] terraform:       + recovery_window_in_days        = 30
19:45:06.251 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"
19:45:06.251 STDOUT [aws] terraform:       + tags                           = {
19:45:06.251 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"
19:45:06.251 STDOUT [aws] terraform:         }
19:45:06.251 STDOUT [aws] terraform:       + tags_all                       = {
19:45:06.251 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-aurora"
19:45:06.251 STDOUT [aws] terraform:         }
19:45:06.251 STDOUT [aws] terraform:         # (1 unchanged attribute hidden)
19:45:06.251 STDOUT [aws] terraform:       + replica (known after apply)
19:45:06.251 STDOUT [aws] terraform:     }
19:45:06.251 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret.openmetadata will be created
19:45:06.251 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret" "openmetadata" {
19:45:06.251 STDOUT [aws] terraform:       + arn                            = (known after apply)
19:45:06.251 STDOUT [aws] terraform:       + description                    = "List of initial user passwords required when building OpenMetadata"
19:45:06.251 STDOUT [aws] terraform:       + force_overwrite_replica_secret = false
19:45:06.252 STDOUT [aws] terraform:       + id                             = (known after apply)
19:45:06.252 STDOUT [aws] terraform:       + name                           = "ethan-dev-secret-apne1-openmetadata"
19:45:06.252 STDOUT [aws] terraform:       + name_prefix                    = (known after apply)
19:45:06.252 STDOUT [aws] terraform:       + policy                         = (known after apply)
19:45:06.252 STDOUT [aws] terraform:       + recovery_window_in_days        = 30
19:45:06.252 STDOUT [aws] terraform:       + region                         = "ap-northeast-1"
19:45:06.252 STDOUT [aws] terraform:       + tags                           = {
19:45:06.252 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"
19:45:06.252 STDOUT [aws] terraform:         }
19:45:06.252 STDOUT [aws] terraform:       + tags_all                       = {
19:45:06.252 STDOUT [aws] terraform:           + "Name" = "ethan-dev-secret-apne1-openmetadata"
19:45:06.252 STDOUT [aws] terraform:         }
19:45:06.252 STDOUT [aws] terraform:       + replica (known after apply)
19:45:06.252 STDOUT [aws] terraform:     }
19:45:06.252 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.aurora will be created
19:45:06.252 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "aurora" {
19:45:06.252 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.253 STDOUT [aws] terraform:       + secret_id            = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + secret_string        = (sensitive value)
19:45:06.253 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)
19:45:06.253 STDOUT [aws] terraform:       + version_id           = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + version_stages       = (known after apply)
19:45:06.253 STDOUT [aws] terraform:     }
19:45:06.253 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.aws_secretsmanager_secret_version.openmetadata will be created
19:45:06.253 STDOUT [aws] terraform:   + resource "aws_secretsmanager_secret_version" "openmetadata" {
19:45:06.253 STDOUT [aws] terraform:       + arn                  = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + has_secret_string_wo = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + id                   = (known after apply)
19:45:06.253 STDOUT [aws] terraform:       + region               = "ap-northeast-1"
19:45:06.253 STDOUT [aws] terraform:       + secret_id            = (known after apply)
19:45:06.254 STDOUT [aws] terraform:       + secret_string        = (sensitive value)
19:45:06.254 STDOUT [aws] terraform:       + secret_string_wo     = (write-only attribute)
19:45:06.254 STDOUT [aws] terraform:       + version_id           = (known after apply)
19:45:06.254 STDOUT [aws] terraform:       + version_stages       = (known after apply)
19:45:06.254 STDOUT [aws] terraform:     }
19:45:06.254 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_admin_password will be created
19:45:06.254 STDOUT [aws] terraform:   + resource "random_password" "airflow_admin_password" {
19:45:06.254 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
19:45:06.254 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.254 STDOUT [aws] terraform:       + length      = 16
19:45:06.254 STDOUT [aws] terraform:       + lower       = true
19:45:06.254 STDOUT [aws] terraform:       + min_lower   = 0
19:45:06.254 STDOUT [aws] terraform:       + min_numeric = 0
19:45:06.254 STDOUT [aws] terraform:       + min_special = 0
19:45:06.254 STDOUT [aws] terraform:       + min_upper   = 0
19:45:06.254 STDOUT [aws] terraform:       + number      = true
19:45:06.254 STDOUT [aws] terraform:       + numeric     = true
19:45:06.254 STDOUT [aws] terraform:       + result      = (sensitive value)
19:45:06.254 STDOUT [aws] terraform:       + special     = false
19:45:06.255 STDOUT [aws] terraform:       + upper       = true
19:45:06.255 STDOUT [aws] terraform:     }
19:45:06.255 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.airflow_db_password will be created
19:45:06.255 STDOUT [aws] terraform:   + resource "random_password" "airflow_db_password" {
19:45:06.255 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
19:45:06.255 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.255 STDOUT [aws] terraform:       + length      = 16
19:45:06.255 STDOUT [aws] terraform:       + lower       = true
19:45:06.255 STDOUT [aws] terraform:       + min_lower   = 0
19:45:06.255 STDOUT [aws] terraform:       + min_numeric = 0
19:45:06.255 STDOUT [aws] terraform:       + min_special = 0
19:45:06.255 STDOUT [aws] terraform:       + min_upper   = 0
19:45:06.255 STDOUT [aws] terraform:       + number      = true
19:45:06.255 STDOUT [aws] terraform:       + numeric     = true
19:45:06.255 STDOUT [aws] terraform:       + result      = (sensitive value)
19:45:06.255 STDOUT [aws] terraform:       + special     = false
19:45:06.255 STDOUT [aws] terraform:       + upper       = true
19:45:06.255 STDOUT [aws] terraform:     }
19:45:06.255 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.aurora_password will be created
19:45:06.255 STDOUT [aws] terraform:   + resource "random_password" "aurora_password" {
19:45:06.255 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
19:45:06.256 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.256 STDOUT [aws] terraform:       + length      = 16
19:45:06.256 STDOUT [aws] terraform:       + lower       = true
19:45:06.256 STDOUT [aws] terraform:       + min_lower   = 0
19:45:06.256 STDOUT [aws] terraform:       + min_numeric = 0
19:45:06.256 STDOUT [aws] terraform:       + min_special = 0
19:45:06.256 STDOUT [aws] terraform:       + min_upper   = 0
19:45:06.256 STDOUT [aws] terraform:       + number      = true
19:45:06.256 STDOUT [aws] terraform:       + numeric     = true
19:45:06.256 STDOUT [aws] terraform:       + result      = (sensitive value)
19:45:06.256 STDOUT [aws] terraform:       + special     = false
19:45:06.256 STDOUT [aws] terraform:       + upper       = true
19:45:06.256 STDOUT [aws] terraform:     }
19:45:06.256 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.elasticsearch_password will be created
19:45:06.256 STDOUT [aws] terraform:   + resource "random_password" "elasticsearch_password" {
19:45:06.256 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
19:45:06.256 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.256 STDOUT [aws] terraform:       + length      = 16
19:45:06.256 STDOUT [aws] terraform:       + lower       = true
19:45:06.257 STDOUT [aws] terraform:       + min_lower   = 0
19:45:06.257 STDOUT [aws] terraform:       + min_numeric = 0
19:45:06.257 STDOUT [aws] terraform:       + min_special = 0
19:45:06.257 STDOUT [aws] terraform:       + min_upper   = 0
19:45:06.257 STDOUT [aws] terraform:       + number      = true
19:45:06.257 STDOUT [aws] terraform:       + numeric     = true
19:45:06.257 STDOUT [aws] terraform:       + result      = (sensitive value)
19:45:06.257 STDOUT [aws] terraform:       + special     = false
19:45:06.257 STDOUT [aws] terraform:       + upper       = true
19:45:06.257 STDOUT [aws] terraform:     }
19:45:06.257 STDOUT [aws] terraform:   # module.openmetadata_secretmanager.random_password.openmetadata_db_password will be created
19:45:06.257 STDOUT [aws] terraform:   + resource "random_password" "openmetadata_db_password" {
19:45:06.257 STDOUT [aws] terraform:       + bcrypt_hash = (sensitive value)
19:45:06.257 STDOUT [aws] terraform:       + id          = (known after apply)
19:45:06.257 STDOUT [aws] terraform:       + length      = 16
19:45:06.257 STDOUT [aws] terraform:       + lower       = true
19:45:06.257 STDOUT [aws] terraform:       + min_lower   = 0
19:45:06.257 STDOUT [aws] terraform:       + min_numeric = 0
19:45:06.257 STDOUT [aws] terraform:       + min_special = 0
19:45:06.257 STDOUT [aws] terraform:       + min_upper   = 0
19:45:06.257 STDOUT [aws] terraform:       + number      = true
19:45:06.258 STDOUT [aws] terraform:       + numeric     = true
19:45:06.258 STDOUT [aws] terraform:       + result      = (sensitive value)
19:45:06.258 STDOUT [aws] terraform:       + special     = false
19:45:06.258 STDOUT [aws] terraform:       + upper       = true
19:45:06.258 STDOUT [aws] terraform:     }
19:45:06.258 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_ec2_managed_prefix_list.allowed_ip_list will be created
19:45:06.258 STDOUT [aws] terraform:   + resource "aws_ec2_managed_prefix_list" "allowed_ip_list" {
19:45:06.258 STDOUT [aws] terraform:       + address_family = "IPv4"
19:45:06.258 STDOUT [aws] terraform:       + arn            = (known after apply)
19:45:06.258 STDOUT [aws] terraform:       + id             = (known after apply)
19:45:06.258 STDOUT [aws] terraform:       + max_entries    = 30
19:45:06.258 STDOUT [aws] terraform:       + name           = "allowed_ip_list"
19:45:06.258 STDOUT [aws] terraform:       + owner_id       = (known after apply)
19:45:06.258 STDOUT [aws] terraform:       + region         = "ap-northeast-1"
19:45:06.258 STDOUT [aws] terraform:       + tags_all       = (known after apply)
19:45:06.258 STDOUT [aws] terraform:       + version        = (known after apply)
19:45:06.258 STDOUT [aws] terraform:       + entry {
19:45:06.258 STDOUT [aws] terraform:           + cidr        = "192.0.2.0/24"
19:45:06.259 STDOUT [aws] terraform:             # (1 unchanged attribute hidden)
19:45:06.259 STDOUT [aws] terraform:         }
19:45:06.259 STDOUT [aws] terraform:     }
19:45:06.259 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.alb_sg will be created
19:45:06.259 STDOUT [aws] terraform:   + resource "aws_security_group" "alb_sg" {
19:45:06.259 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.259 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
19:45:06.259 STDOUT [aws] terraform:       + egress                 = [
19:45:06.259 STDOUT [aws] terraform:           + {
19:45:06.259 STDOUT [aws] terraform:               + cidr_blocks      = [
19:45:06.259 STDOUT [aws] terraform:                   + "0.0.0.0/0",
19:45:06.259 STDOUT [aws] terraform:                 ]
19:45:06.259 STDOUT [aws] terraform:               + from_port        = 0
19:45:06.259 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.259 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.259 STDOUT [aws] terraform:               + protocol         = "-1"
19:45:06.259 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.259 STDOUT [aws] terraform:               + self             = false
19:45:06.259 STDOUT [aws] terraform:               + to_port          = 0
19:45:06.259 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.260 STDOUT [aws] terraform:             },
19:45:06.260 STDOUT [aws] terraform:         ]
19:45:06.260 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.260 STDOUT [aws] terraform:       + ingress                = [
19:45:06.260 STDOUT [aws] terraform:           + {
19:45:06.260 STDOUT [aws] terraform:               + cidr_blocks      = []
19:45:06.260 STDOUT [aws] terraform:               + from_port        = 443
19:45:06.260 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.260 STDOUT [aws] terraform:               + prefix_list_ids  = (known after apply)
19:45:06.260 STDOUT [aws] terraform:               + protocol         = "tcp"
19:45:06.260 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.260 STDOUT [aws] terraform:               + self             = false
19:45:06.260 STDOUT [aws] terraform:               + to_port          = 443
19:45:06.260 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.260 STDOUT [aws] terraform:             },
19:45:06.260 STDOUT [aws] terraform:         ]
19:45:06.260 STDOUT [aws] terraform:       + name                   = (known after apply)
19:45:06.260 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
19:45:06.260 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.261 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.261 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
19:45:06.261 STDOUT [aws] terraform:       + tags                   = {
19:45:06.261 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"
19:45:06.261 STDOUT [aws] terraform:         }
19:45:06.261 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.261 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-alb"
19:45:06.261 STDOUT [aws] terraform:         }
19:45:06.261 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.261 STDOUT [aws] terraform:     }
19:45:06.261 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.aurora_sg will be created
19:45:06.261 STDOUT [aws] terraform:   + resource "aws_security_group" "aurora_sg" {
19:45:06.261 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.261 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
19:45:06.261 STDOUT [aws] terraform:       + egress                 = [
19:45:06.261 STDOUT [aws] terraform:           + {
19:45:06.261 STDOUT [aws] terraform:               + cidr_blocks      = [
19:45:06.261 STDOUT [aws] terraform:                   + "0.0.0.0/0",
19:45:06.261 STDOUT [aws] terraform:                 ]
19:45:06.261 STDOUT [aws] terraform:               + from_port        = 0
19:45:06.262 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.262 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.262 STDOUT [aws] terraform:               + protocol         = "-1"
19:45:06.262 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.262 STDOUT [aws] terraform:               + self             = false
19:45:06.262 STDOUT [aws] terraform:               + to_port          = 0
19:45:06.262 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.262 STDOUT [aws] terraform:             },
19:45:06.262 STDOUT [aws] terraform:         ]
19:45:06.262 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.262 STDOUT [aws] terraform:       + ingress                = [
19:45:06.262 STDOUT [aws] terraform:           + {
19:45:06.262 STDOUT [aws] terraform:               + cidr_blocks      = []
19:45:06.262 STDOUT [aws] terraform:               + from_port        = 5432
19:45:06.262 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.262 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.262 STDOUT [aws] terraform:               + protocol         = "tcp"
19:45:06.262 STDOUT [aws] terraform:               + security_groups  = (known after apply)
19:45:06.262 STDOUT [aws] terraform:               + self             = false
19:45:06.263 STDOUT [aws] terraform:               + to_port          = 5432
19:45:06.263 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.263 STDOUT [aws] terraform:             },
19:45:06.263 STDOUT [aws] terraform:         ]
19:45:06.263 STDOUT [aws] terraform:       + name                   = (known after apply)
19:45:06.263 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
19:45:06.263 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.263 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.263 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
19:45:06.263 STDOUT [aws] terraform:       + tags                   = {
19:45:06.263 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"
19:45:06.263 STDOUT [aws] terraform:         }
19:45:06.263 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.263 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-aurora"
19:45:06.263 STDOUT [aws] terraform:         }
19:45:06.263 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.263 STDOUT [aws] terraform:     }
19:45:06.263 STDOUT [aws] terraform:   # module.openmetadata_security_group.aws_security_group.ecs_sg will be created
19:45:06.263 STDOUT [aws] terraform:   + resource "aws_security_group" "ecs_sg" {
19:45:06.263 STDOUT [aws] terraform:       + arn                    = (known after apply)
19:45:06.264 STDOUT [aws] terraform:       + description            = "Managed by Terraform"
19:45:06.264 STDOUT [aws] terraform:       + egress                 = [
19:45:06.264 STDOUT [aws] terraform:           + {
19:45:06.264 STDOUT [aws] terraform:               + cidr_blocks      = [
19:45:06.264 STDOUT [aws] terraform:                   + "0.0.0.0/0",
19:45:06.264 STDOUT [aws] terraform:                 ]
19:45:06.264 STDOUT [aws] terraform:               + from_port        = 0
19:45:06.264 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.264 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.264 STDOUT [aws] terraform:               + protocol         = "-1"
19:45:06.264 STDOUT [aws] terraform:               + security_groups  = []
19:45:06.264 STDOUT [aws] terraform:               + self             = false
19:45:06.264 STDOUT [aws] terraform:               + to_port          = 0
19:45:06.264 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.264 STDOUT [aws] terraform:             },
19:45:06.264 STDOUT [aws] terraform:         ]
19:45:06.264 STDOUT [aws] terraform:       + id                     = (known after apply)
19:45:06.264 STDOUT [aws] terraform:       + ingress                = [
19:45:06.264 STDOUT [aws] terraform:           + {
19:45:06.264 STDOUT [aws] terraform:               + cidr_blocks      = []
19:45:06.265 STDOUT [aws] terraform:               + from_port        = 8585
19:45:06.265 STDOUT [aws] terraform:               + ipv6_cidr_blocks = []
19:45:06.265 STDOUT [aws] terraform:               + prefix_list_ids  = []
19:45:06.265 STDOUT [aws] terraform:               + protocol         = "tcp"
19:45:06.265 STDOUT [aws] terraform:               + security_groups  = (known after apply)
19:45:06.265 STDOUT [aws] terraform:               + self             = false
19:45:06.265 STDOUT [aws] terraform:               + to_port          = 8585
19:45:06.265 STDOUT [aws] terraform:                 # (1 unchanged attribute hidden)
19:45:06.265 STDOUT [aws] terraform:             },
19:45:06.265 STDOUT [aws] terraform:         ]
19:45:06.265 STDOUT [aws] terraform:       + name                   = (known after apply)
19:45:06.265 STDOUT [aws] terraform:       + name_prefix            = (known after apply)
19:45:06.265 STDOUT [aws] terraform:       + owner_id               = (known after apply)
19:45:06.265 STDOUT [aws] terraform:       + region                 = "ap-northeast-1"
19:45:06.265 STDOUT [aws] terraform:       + revoke_rules_on_delete = false
19:45:06.265 STDOUT [aws] terraform:       + tags                   = {
19:45:06.265 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"
19:45:06.265 STDOUT [aws] terraform:         }
19:45:06.265 STDOUT [aws] terraform:       + tags_all               = {
19:45:06.266 STDOUT [aws] terraform:           + "Name" = "ethan-dev-sg-apne1-ecs"
19:45:06.266 STDOUT [aws] terraform:         }
19:45:06.266 STDOUT [aws] terraform:       + vpc_id                 = (known after apply)
19:45:06.266 STDOUT [aws] terraform:     }
19:45:06.266 STDOUT [aws] terraform: Plan: 77 to add, 0 to change, 0 to destroy.
19:45:06.266 STDOUT [aws] terraform: 
```
</details>
